zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/spim_reg.h
/**************************************************************************//**
 * @file     spim_reg.h
 * @version  V1.00
 * @brief    SPIM register definition header file
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/

#ifndef __SPIM_REG_H__
#define __SPIM_REG_H__

#if defined ( __CC_ARM   )
    #pragma anon_unions
#endif

/**
    @addtogroup REGISTER Control Register
  @{

*/

/**
    @addtogroup SPIM SPI/Hyper Bus Synchronous Serial Interface Controller (SPIM)
    Memory Mapped Structure for SPIM Controller
    @{
*/

typedef struct
{
    /**
     * @var SPIM_T::CTL0
     * Offset: 0x00  Control and Status Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |CIPHOFF   |Cipher Disable Bit
     * |        |          |0 = Cipher function Enabled.
     * |        |          |1 = Cipher function Disabled.
     * |        |          |Note 1: When CIPHOFF(SPIM_CTL0[0]) is 0 and OTF AES engine outside SPIM is enabled, encryption/decryption of SPIM is enabled.
     * |        |          |Note 2: When encryption/decryption of SPIM is enabled, please set DESELTIM (SPIM_DMMCTL[23:16]) >= 0x10
     * |        |          |When encryption/decryption of SPIM is disabled, please set DESELTIM(SPIM_DMMCTL[23:16]) >= 0x8.
     * |[3:2]   |DEVMODE   |Device Mode
     * |        |          |0x0 = SPIROM operates in SPI Flash device mode.
     * |        |          |0x1 = SPIROM operates in HYPER RAM device mode.
     * |        |          |0x2 = SPIROM operates in HYPER Flash device mode.
     * |        |          |0x3 = Reserved.
     * |[5]     |B4ADDREN  |4-byte Address Mode Enable Bit
     * |        |          |0 = 3-byte address mode Enabled.
     * |        |          |1 = 4-byte address mode Enabled.
     * |        |          |Note: Used for DMA write mode, DMA read mode, and DMM mode.
     * |[6]     |IEN       |Interrupt Enable Bit
     * |        |          |0 = SPIM Interrupt Disabled.
     * |        |          |1 = SPIM Interrupt Enabled.
     * |[7]     |IF        |Interrupt Flag
     * |        |          |Write Operation:
     * |        |          |0 = No effect.
     * |        |          |1 = Write 1 to clear.
     * |        |          |Read Operation:
     * |        |          |0 = The transfer has not finished yet.
     * |        |          |1 = The transfer has done.
     * |[12:8]  |DWIDTH    |Transmit/Receive Bit Length
     * |        |          |This specifies how many bits are transmitted/received in one transmit/receive transaction.
     * |        |          |0x7 = 8 bits.
     * |        |          |0xF = 16 bits.
     * |        |          |0x17 = 24 bits.
     * |        |          |0x1F = 32 bits.
     * |        |          |Others = Incorrect transfer result.
     * |        |          |Note 1: Only used for normal I/O mode.
     * |        |          |Note 2: Only 8, 16, 24, and 32 bits are allowed. Other bit length will result in incorrect transfer.
     * |        |          |Note 3: Only 16 and 32 bits are allowed when both of Octal mode and DTR mode of normal I/O mode are enabled
     * |        |          |Other bit length will result in incorrect transfer.
     * |[14:13] |BURSTNUM  |Transmit/Receive Burst Number
     * |        |          |This field specifies how many transmit/receive transactions should be executed continuously in one transfer.
     * |        |          |0x0 = Only one transmit/receive transaction will be executed in one transfer.
     * |        |          |0x1 = Two successive transmit/receive transactions will be executed in one transfer.
     * |        |          |0x2 = Three successive transmit/receive transactions will be executed in one transfer.
     * |        |          |0x3 = Four successive transmit/receive transactions will be executed in one transfer.
     * |        |          |Note: Only used for normal I/O Mode.
     * |[15]    |QDIODIR   |SPI Interface Direction Select for Normal I/O Mode
     * |        |          |0 = Interface signals are input.
     * |        |          |1 = Interface signals are output.
     * |        |          |Note: Only used for normal I/O mode.
     * |[19:16] |SUSPITV   |Suspend Interval
     * |        |          |These four bits provide the configuration of suspend interval between two successive transmit/receive transactions in a transfer
     * |        |          |The default value is 0x00
     * |        |          |When BURSTNUM = 00, setting this field has no effect on transfer
     * |        |          |The desired interval is obtained according to the following equation (from the last falling edge of current SPI clock to the first rising edge of next SPI clock):
     * |        |          |(SUSPITV+2)*period of AHB clock
     * |        |          |0x0 = Hardware will control this item by DIVIDER (SPIM_CTL1[31:16]) automatically.
     * |        |          |0x1 = 8 AHB clock cycles.
     * |        |          |....
     * |        |          |0xE = 21 AHB clock cycles.
     * |        |          |0xF = 22 AHB clock cycles.
     * |        |          |Note: Only used for normal I/O mode.
     * |[21:20] |BITMODE   |SPI Interface Bit Mode
     * |        |          |0x0 = Standard mode.
     * |        |          |0x1 = Dual mode.
     * |        |          |0x2 = Quad mode.
     * |        |          |0x3 = Octal mode.
     * |        |          |Note: Only used for normal I/O mode.
     * |[23:22] |OPMODE    |SPI Function Operation Mode
     * |        |          |0x0 = Normal I/O mode.
     * |        |          |0x1 = DMA write mode.
     * |        |          |0x2 = DMA read mode.
     * |        |          |0x3 = Direct Memory Mapping mode (DMM mode) (Default).
     * |        |          |Note 1: In DMA write mode, hardware will send just one page program command per operation
     * |        |          |Users must take care of cross-page cases.
     * |        |          |Note 2: For SPI Flash and Hyper device with 32 Mbytes, access address range is from 0x00000000 to 0x01FFFFFF when using Normal I/O mode, DMA write mode, and DMA read mode to write/read SPI Flash and Hyper device
     * |        |          |Please user check size of used SPI Flash component to know access address range of SPI Flash and Hyper device.
     * |        |          |Note 3: For SPI Flash and Hyper device with 32 Mbytes, access address range is from 0x08000000 to 0x09FFFFFF when using Direct Memory mapping mode (DMM mode) to read SPI Flash and write/read Hyper device
     * |        |          |Please user check size of used storage components to know access address range.
     * |[24]    |DTR_NORM  |Double Transfer Rate Mode Enable Bit for Normal I/O Mode
     * |        |          |In master mode, SPI will receive data at both rising edge and falling edge of SPI bus clock.
     * |        |          |0 = DTR mode Disabled (i.e. Single Transfer Rate (STR) mode enabled).
     * |        |          |1 = DTR mode Enabled.
     * |        |          |Note: Only used for normal I/O mode.
     * |[25]    |RDQS_NORM |Read DQS Mode Enable Bit for Normal I/O Mode
     * |        |          |In SPI master mode, SPI uses read DQS signal, which is generated by SPI Flash, to sample RX data from SPI Flash when Read DQS mode is enabled.
     * |        |          |0 = Read DQS mode Disabled.
     * |        |          |1 = Read DQS mode Enabled.
     * |        |          |Note: Only used for normal I/O mode.
     * |[27:26] |RBO_NORM  |Received Data Byte Order of Normal I/O Mode for Octal SPI Flash
     * |        |          |(1) Data width = 8-bits:.
     * |        |          |0x0 = Byte order of received data from SPI Flash is byte0.
     * |        |          |Other = Reserved.
     * |        |          |(2) Data width = 16-bits:.
     * |        |          |0x0 = Byte order of received data from SPI Flash is byte0, byte1.
     * |        |          |0x1 = Byte order of received data from SPI Flash is byte1, byte0.
     * |        |          |Other = Reserved.
     * |        |          |(3) Data width = 24-bits:.
     * |        |          |0x0 = Byte order of received data from SPI Flash is byte0, byte1, byte2.
     * |        |          |0x1 = Byte order of received data from SPI Flash is byte2, byte1, byte0.
     * |        |          |Other = Reserved.
     * |        |          |(4) Data width = 32-bits:.
     * |        |          |0x0 = Byte order of received data from SPI Flash is byte0, byte1, byte2, byte3.
     * |        |          |0x1 = Byte order of received data from SPI Flash is byte3, byte2, byte1, byte0.
     * |        |          |0x2 = Byte order of received data from SPI Flash is byte1, byte0, byte3, byte2.
     * |        |          |0x3 = Byte order of received data from SPI Flash is byte2, byte3, byte0, byte1.
     * |[31]    |SPI_RSTN  |SPI Flash Reset Enable Bit for SPI Flash
     * |        |          |User can set this control register to reset SPI Flash device in SPI Flash mode (i.e
     * |        |          |DEVMODE (SPIM_CTL0[3:2]) = 0x0).
     * |        |          |0 = Set SPIM_RESETn pin to low.
     * |        |          |1 = Set SPIM_RESETn to high (Default).
     * @var SPIM_T::CTL1
     * Offset: 0x04  Control and Status Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |SPIMEN    |Go and Busy Status
     * |        |          |Write Operation:
     * |        |          |0 = No effect.
     * |        |          |1 = Start the transfer
     * |        |          |This bit remains set during the transfer and is automatically cleared after transfer finished.
     * |        |          |Read Operation:
     * |        |          |0 = The transfer has done.
     * |        |          |1 = The transfer has not finished yet.
     * |        |          |Note: All registers should be set before writing 1 to the SPIMEN bit
     * |        |          |When a transfer is in progress, user should not write to any register of this peripheral.
     * |[1]     |CACHEOFF  |Cache Memory Function Disable Bit
     * |        |          |0 = Cache memory function Enabled. (Default)
     * |        |          |1 = Cache memory function Disabled.
     * |[3]     |CDINVAL   |Cache Data Invalid Enable Bit
     * |        |          |Write Operation:
     * |        |          |0 = No effect.
     * |        |          |1 = Set all cache data to be invalid. This bit is cleared by hardware automatically.
     * |        |          |Read Operation: No effect
     * |        |          |Note: When Flash memory is page erasing or chip erasing, please set CDINVAL to 0x1.
     * |[4]     |SS        |Slave Select Active Enable Bit
     * |        |          |0 = SPIM_SS is in active level.
     * |        |          |1 = SPIM_SS is in inactive level (Default).
     * |        |          |Note: This interface can only drive one device/slave at a given time
     * |        |          |Therefore, the slave selects of the selected device must be set to its active level before starting any read or write transfer
     * |        |          |Functional description of SSACTPOL(SPIM_CTL1[5]) and SS is shown in Table 1.1-1
     * |[5]     |SSACTPOL  |Slave Select Active Level
     * |        |          |It defines the active level of device/slave select signal (SPIM_SS), as shown in Table 1.1-1
     * |        |          |0 = The SPIM_SS slave select signal is active low.
     * |        |          |1 = The SPIM_SS slave select signal is active high.
     * |[11:8]  |IDLETIME  |Idle Time Interval
     * |        |          |In DMM mode, IDLETIME is set to control the minimum idle time between two SPI Flash accesses.
     * |        |          |Minimum idle time = (IDLETIME + 1) * AHB clock cycle time.
     * |        |          |Note 1: Only used for DMM mode.
     * |        |          |Note 2: AHB clock cycle time = 1/AHB clock frequency.
     * |[31:16] |DIVIDER   |Clock Divider Register
     * |        |          |The value in this field is the frequency divider of the AHB clock (HCLK) to generate the serial SPI output clock "SCLK" on the output SPIM_CLK pin
     * |        |          |The desired frequency is obtained according to the following equation:
     * |        |          |Note 1: When set DIVIDER to zero, the frequency of SPIM_CLK will be equal to the frequency of HCLK.
     * |        |          |Note 2: SCLK is serial SPI output clock.
     * |        |          |Note 3: Each SPI Flash command has the limitation of the maximum operation frequency of SCLK
     * |        |          |Please check the specification of the used SPI Flash component to decide the frequency of SPI Flash clock for different command operations of SPI Flash.
     * |        |          |Note 4: For DTR (Double Transfer Rate) commands, the setting values of DIVIDER are only 1,2,4,8,16,32,...
     * |        |          |Note 5: For commands of HyperBus device, the setting values of DIVIDER are only 1 and 2.
     * @var SPIM_T::RXCLKDLY
     * Offset: 0x0C  RX Clock Delay Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |RDDLYSEL  |Sampling Clock Delay Selection for Received Data for Normal I/O Mode, DMA Read Mode, DMA Write Mode, Direct Memory Mapping Mode, and SPI FLASH Only
     * |        |          |Determine the number of inserted delay cycles
     * |        |          |Used to adjust the sampling clock of received data to latch the correct data.
     * |        |          |0x0: No delay. (Default)
     * |        |          |0x1: Delay 0.5 SPI Flash clock.
     * |        |          |0x2: Delay 1 SPI Flash clocks.
     * |        |          |0x3: Delay 1.5 SPI Flash clocks.
     * |        |          |....
     * |        |          |0xf: Delay 7.5 SPI Flash clocks
     * |        |          |Note 1: The manufacturer or device ID of SPI Flash component can be used to determine the correct setting value of RDDLYSEL
     * |        |          |An example is given as follows.
     * |        |          |For example, the manufacturer ID and device ID of SPI Flash for some vendor are 0xEF and 0x1234 separately
     * |        |          |First, set RDDLYSEL to 0x0, and use read manufacturer id/device id command to read the manufacturer id of SPI Flash by using normal I/O mode (the manufacturer id is 0xEF (1110_1111) in this example).
     * |        |          |If the manufacturer ID which reads from SPI Flash is 0xF7 (1111_0111), it denotes that manufacturer id is shifted the right by 1 bit and most significant bit (MSB) of manufacturer id is assigned to 1
     * |        |          |According to manufacturer id reads from SPI Flash, RDDLYSEL needs to be set to 0x1 to receive SPI Flash data correctly.
     * |        |          |Note 2: If read command of SPI FLASH sneds out DS (Data Strobe), and we recommand to use DS and HYPERDLL to sample RX data from SPI FLASH
     * |        |          |RDDLYSEL is only used to sample RX data when read command of SPI FLASH doesnu2019t send out DS (Data Strobe).
         * @var SPIM_T::RX[4]
         * Offset: 0x10 ~ 0x1C Data Receive Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |RXDAT     |Data Receive Register
     * |        |          |The Data Receive Registers hold the received data of the last executed transfer.
     * |        |          |Number of valid RX registers is specified in SPIM_CTL0[BURSTNUM]
     * |        |          |If BURSTNUM > 0, received data are held in the most significant RXDAT register first.
     * |        |          |Number of valid-bit is specified in SPIM_CTL0[DWIDTH]
     * |        |          |If DWIDTH is 16, 24, or 32, received data are held in the least significant byte of RXDAT register first.
     * |        |          |In a byte, received data are held in the most significant bit of RXDAT register first.
     * |        |          |Example1: If SPIM_CTL0[BURSTNUM] = 0x3 and SPIM_CTL1[DWIDTH] = 0x17, received data will be held in the order SPIM_RX3[23:0], SPIM_RX2[23:0], SPIM_RX1[23:0], SPIM_RX0[23:0].
     * |        |          |Example2: If SPIM_CTL0[BURSTNUM] = 0x0 and SPIM_CTL0[DWIDTH] = 0x07, received data will be held in the order SPIM_RX0[7], SPIM_RX0[6], .....,
     * |        |          |SPIM_RX0[0].
     * @var SPIM_T::TX[4]
     * Offset: 0x20 ~ 0x2C Data Transmit Register 0 ~ 3
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |TXDAT     |Data Transmit Register
     * |        |          |The Data Transmit Registers hold the data to be transmitted in next transfer.
     * |        |          |Number of valid TXDAT registers is specified in SPIM_CTL0[BURSTNUM]
     * |        |          |If BURSTNUM > 0, data are transmitted in the most significant TXDAT register first.
     * |        |          |Number of valid-bit is specified in SPIM_CTL0[DWIDTH]
     * |        |          |If DWIDTH is 16, 24, or 32, data are transmitted in the least significant byte of TXDAT register first.
     * |        |          |In a byte, data are transmitted in the most significant bit of TXDAT register first.
     * |        |          |Example1: If SPIM_CTL0[BURSTNUM] = 0x3 and SPIM_CTL1[DWIDTH] = 0x17, data will be transmitted in the order SPIM_TX3[23:0], SPIM_TX2[23:0], SPIM_TX1[23:0], SPIM_TX0[23:0] in next transfer.
     * |        |          |Example2: If SPIM_CTL0[BURSTNUM] = 0x0 and SPIM_CTL0[DWIDTH] = 0x17, data will be transmitted in the order SPIM_TX0[7:0], SPIM_TX0[15:8], SPIM_TX0[23:16] in next transfer.
     * |        |          |Example3: If SPIM_CTL0[BURSTNUM] = 0x0 and SPIM_CTL0[DWIDTH] = 0x07, data will be transmitted in the order SPIM_TX0[7], SPIM_TX0[6], ...,
     * |        |          |SPIM_TX0[0] in next transfer.
     * @var SPIM_T::SRAMADDR
     * Offset: 0x30  SRAM Memory Address Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |ADDR      |SRAM Memory Address
     * |        |          |For DMA Read mode, this is the destination address for DMA transfer.
     * |        |          |For DMA Write mode, this is the source address for DMA transfer.
     * |        |          |Note: This address must be 8bytes aligned.
     * @var SPIM_T::DMACNT
     * Offset: 0x34  DMA Transfer Byte Count Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[23:0]  |DMACNT    |DMA Transfer Byte Count Register
     * |        |          |It indicates the transfer length for DMA process.
     * |        |          |Note 1: The unit for counting is byte and the number must be the multiple of 8.
     * |        |          |Note 2: The page program instruction allows from one byte to 256 bytes (a page) of data to be programmed at previously erased (FFh) memory locations for SPI Flash device.
     * |        |          |Note 3: A maximum of 512 bytes can be programmed as long as an aligned 512-byte address boundary is not crossed for HYPER Flash device.
     * |        |          |Note 4: Please check specification of used SPI Flash and Hyper Flash to know maximum byte length of page program and program address boundary.
     * @var SPIM_T::FADDR
     * Offset: 0x38  Address Register for SPI Flash and Hyper Device
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |ADDR      |Address Register for SPI Flash and Hyper Device
     * |        |          |For DMA Read mode, this is the source address for DMA transfer.
     * |        |          |For DMA Write mode, this is the destination address for DMA transfer.
     * |        |          |Note 1: This address must be 8bytes aligned.
     * |        |          |Note 2: A maximum of 512 bytes can be programmed as long as an aligned 512-byte address boundary is not crossed for HYPER Flash device.
     * |        |          |Note 3: For SPI Flash and Hyper device with 32 Mbytes, the value "ADDR" is from 0x00000000 to 0x00FFFFFF when using DMA write mode and DMA read mode to write/read data of SPI Flash and Hyper device
     * |        |          |Please check specification of used SPI Flash and Hyper Flash to know access address range and program address boundary.
     * @var SPIM_T::DMMCTL
     * Offset: 0x44  Direct Memory Mapping Mode Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |ACTSCLKT  |SPI Flash Active SCLK Time for Direct Memory Mapping Mode, DMA Write Mode, and DMA Read Mode Only
     * |        |          |The bits set time interval between SPIM SS active edge and the position edge of the first serial SPI output clock, as shown in Figure 1.1-5.
     * |        |          |(1) ACTSCLKT = 0 (function disable):.
     * |        |          |Time interval = 1 AHB clock cycle time.
     * |        |          |(2) ACTSCLKT u2260 0 (function enable):
     * |        |          |Time interval = (ACTSCLKT + 3) * AHB clock cycle time.
     * |        |          |Note 1: AHB clock cycle time = 1/AHB clock frequency.
     * |        |          |Note 2: SCLK is SPI output clock
     * |        |          |Note 3: Please check the used SPI Flash specification to know the setting value of this register, and different SPI Flash vendor may use different setting values.
     * |[23:16] |DESELTIM  |SPI Flash Deselect Time for Direct Memory Mapping Mode Only
     * |        |          |Set the minimum time width of SPI Flash deselect time (i.e
     * |        |          |Minimum SPIM_SS deselect time), as shown in Figure 1.1-5.
     * |        |          |(1) Cache function disable:
     * |        |          |Minimum time width of SPIM_SS deselect time = (DESELTIM + 1) * AHB clock cycle time.
     * |        |          |(2) Cache function enable:
     * |        |          |Minimum time width of SPIM_SS deselect time = (DESELTIM + 4) * AHB clock cycle time.
     * |        |          |Note 1: AHB clock cycle time = 1/AHB clock frequency.
     * |        |          |Note 2: When cipher encryption/decryption is enabled, please set this register value >= 0x10
     * |        |          |When cipher encryption/decryption is disabled, please set this register value >= 0x8.
     * |        |          |Note 3: Please check the used SPI Flash specification to know the setting value of this register, and different SPI Flash vendor may use different setting values.
     * |[24]    |BWEN      |16 Bytes Burst Wrap Mode Enable Bit for Direct Memory Mapping Mode, and Read Command Code 0xEB, and 0xE7 Only
     * |        |          |0 = Burst Wrap Mode Disabled. (Default)
     * |        |          |1 = Burst Wrap Mode Enabled.
