zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/spim_reg.h
     * |        |          |In direct memory mapping mode, both of quad read commands "0xEB" and "0xE7" support burst wrap mode for cache application.
     * |[25]    |CREN      |Continuous Read Mode Enable Bit for Direct Memory Mapping Mode, Read Command Codes 0xBB, 0xEB, 0xE7, 0x0D, 0xBD, and 0xED Only
     * |        |          |0 = Continuous Read Mode Disabled. (Default)
     * |        |          |1 = Continuous Read Mode Enabled.
     * |        |          |For read operations of SPI Flash, commands of fast read quad I/O (0xEB), word read quad I/O (0xE7), fast read dual I/O (0xBB), DTR fast read (0x0D), DTR fast read dual I/O (0xBD), and DTR fast read quad I/O (0xED) can further reduce cycles of command phase overhead through setting the "continuous read mode" after address phase.
     * |        |          |Note: When user sets CREN to 1 to use continuous read mode, SPIM_MODE must be set by used SPI Flash specifications.
     * |[26]    |UACTSCLK  |User Sets SPI Flash Active SCLK Time for Direct Memory Mapping Mode, DMA Write Mode, and DMA Read Mode Only
     * |        |          |0 = According to DIVIDER(SPIM_CTL1[31:16]), ACTSCLKT(SPIM_DMMCTL[7:0]) is set by hardware automatically
     * |        |          |(Default)
     * |        |          |1 = Set ACTSCLKT(SPIM_DMMCTL[7:0]) by user manually.
     * |        |          |Note: When user wants to set ACTSCLKT(SPIM_DMMCTL[7:0]) manually, please set UACTSCLK to 1.
     * |[27]    |HYPDONE   |Set All Read/Write Operations Done in Direct Memory Mapping Mode for HYPER Device
     * |        |          |0 = Finish process of all read/write operations is done in DMM mode for HYPER device.
     * |        |          |1 = Finish process of all read/write operations is executed in DMM mode for HYPER device
     * |        |          |This bit is cleared by hardware automatically.
     * |        |          |Note 1: User must set this bit to 1 after all read/write operations are done in DMM mode for HYPER device, and wait this bit to 0 to indicate that finish process of all read/write operations is done in DMM mode for HYPER device.
     * |        |          |Note 2: User must set this bit to 1 before user switches SPIM operation mode (SPIM_CTL0[23:22]) from DMM mode to Normal I/O mode, DMA write mode, or DMA read mode.
     * |        |          |Note 3: In SPIM DMM mode, user must set this bit to 1 before user switches SPIM cache function from enable to disable, or from disable to enable.
     * |[31]    |DMMIDLE   |DMM Mode Idle State for DMM mode only
     * |        |          |0 = DMM mode is in busy state.
     * |        |          |1 = DMM mode is in idle state.
     * |        |          |Note 1: User can polling this status register to know DMM mode is in idle state or busy state when user wants to change OPMODE (SPIM_CTL0[23:22]) from DMM mode to Normal I/O mode/DMA write mode/DMA read mode, SPIM cipher enable/disable switch (SPIM_CTL[0]), SPIM cache enable/disable switch (SPIM_CTL1[1]).
     * |        |          |Note 2: This status register keep to 1 when SPIM is in Normal I/O mode, DMA write mode, and DMA read mode.
     * @var SPIM_T::CTL2
     * Offset: 0x48  Control and Status Register 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:8]  |DC_DMAR   |Dummy Cycle Number for DMA Read Mode Only
     * |        |          |Set number of dummy cycles for DMA read mode only.
     * |        |          |Note 1: When there is not any dummy cycles in this used read command of SPI Flash, user must set DC_DMAR to 0x0.
     * |        |          |Note 2: Number of dummy cycles depends on the frequency of SPI output clock, SPI Flash vendor, and read command types
     * |        |          |Please check the used SPI Flash specification to know the setting value of this number of dummy cycles.
     * |[23:16] |DC_DMM    |Dummy Cycle Number for Direct Memory Mapping Mode Only
     * |        |          |Set number of dummy cycles for direct memory mapping mode only.
     * |        |          |Note 1: When there is not any dummy cycles in this used read command of SPI Flash, user must set DC_DMM to 0x0.
     * |        |          |Note 2: Number of dummy cycles depends on the frequency of SPI output clock, SPI Flash vendor, and read command types
     * |        |          |Please check the used SPI Flash specification to know the setting value of this number of dummy cycles.
     * @var SPIM_T::CMDCODE
     * Offset: 0x4C  Command Code Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |CMDCODE   |SPI Flash Command Code
     * |        |          |The SPI Flash command codes are separated in the following types.
     * |        |          |(1) Page Program Command Code for DMA Write mode of SPIM
     * |        |          |(2) Read Command Code for DMA Read mode and DMM mode of SPIM
     * |        |          |Note 1: Quad mode of SPI Flash must be enabled first by normal I/O mode before using quad page program/quad read commands.
     * |        |          |Note 2: Please check SPI Flash specifications for support command codes.
     * |        |          |Note 3: Please disable "continuous read mode" and "burst wrap mode" before DMA write mode of SPI Flash controller is used to program data of SPI Flash.
     * @var SPIM_T::MODE
     * Offset: 0x50  Mode Data Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |MODEDATA  |Mode Data Register
     * |        |          |Set output data for mode phase.
     * |        |          |When user sets this mode data (Note1) and set CREN(SPIM_DMMCTL[25]) to enter continuous read mode, this will reduce the command phase by eight clocks and allows the read address to be immediately entered after SPIM_SS asserted to active
     * |        |          |(Note1)
     * |        |          |Note 1: Please check the used SPI Flash specification to know the setting value of this mode bits data, and different SPI Flash vendor may use different setting values.
     * @var SPIM_T::PHDMAW
     * Offset: 0x54  Phase Setting Register for DMA Write Mode
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |DW_CMD    |Data Width for Command Phase
     * |        |          |This specifies how many bits are transmitted in this phase.
     * |        |          |0x0 = No command phase.
     * |        |          |0x1 = 8 bits.
     * |        |          |0x2 = 16 bits.
     * |        |          |0x3 = 24 bits.
     * |        |          |0x4 = 32 bits.
     * |        |          |Other = Reserved.
     * |        |          |Note: Only used for DMA Write mode.
     * |[3]     |DTR_CMD   |Double Transfer Rate Mode Enable Bit for Command Phase
     * |        |          |In master mode, SPI will transmit data at both rising edge and falling edge of SPI bus clock.
     * |        |          |0 = DTR mode Disabled (i.e. Single Transfer Rate (STR) mode enabled).
     * |        |          |1 = DTR mode Enabled.
     * |        |          |Note: Only used for DMA Write mode.
     * |[6:4]   |BM_CMD    |SPI Interface Bit Mode for Command Phase
     * |        |          |0x0 = Standard mode.
     * |        |          |0x1 = Dual mode.
     * |        |          |0x2 = Quad mode.
     * |        |          |0x3 = Octal mode.
     * |        |          |Other = Reserved.
     * |        |          |Note: Only used for DMA Write mode.
     * |[10:8]  |DW_ADDR   |Data Width for Address Phase
     * |        |          |This specifies how many bits are transmitted in this phase.
     * |        |          |0x0 = No address phase.
     * |        |          |0x1 = 8 bits.
     * |        |          |0x2 = 16 bits.
     * |        |          |0x3 = 24 bits.
     * |        |          |0x4 = 32 bits.
     * |        |          |Other = Reserved.
     * |        |          |Note: Only used for DMA Write mode.
     * |[11]    |DTR_ADDR  |Double Transfer Rate Mode Enable Bit for Address Phase
     * |        |          |In master mode, SPI will transmit data at both rising edge and falling edge of SPI bus clock.
     * |        |          |0 = DTR mode Disabled (i.e. Single Transfer Rate (STR) mode enabled).
     * |        |          |1 = DTR mode Enabled.
     * |        |          |Note: Only used for DMA Write mode.
     * |[14:12] |BM_ADDR   |SPI Interface Bit Mode for Address Phase
     * |        |          |0x0 = Standard mode.
     * |        |          |0x1 = Dual mode.
     * |        |          |0x2 = Quad mode.
     * |        |          |0x3 = Octal mode.
     * |        |          |Other = Reserved.
     * |        |          |Note: Only used for DMA Write mode.
     * |[24]    |DTR_DATA  |Double Transfer Rate Mode Enable Bit for Data Phase
     * |        |          |In master mode, SPI will receive data at both rising edge and falling edge of SPI bus clock.
     * |        |          |0 = DTR mode Disabled (i.e. Single Transfer Rate (STR) mode enabled).
     * |        |          |1 = DTR mode Enabled.
     * |        |          |Note: Only used for DMA Write mode.
     * |[27:26] |PBO_DATA  |Program Data Byte Order of Program Data Phase for Octal SPI Flash
     * |        |          |0x0 = Byte order of program data to SPI Flash is byte0, byte1, byte2, byte3, byte4, byte5, byte6, byte7.
     * |        |          |0x1 = Byte order of program data to SPI Flash is byte7, byte6, byte5, byte4, byte3, byte2, byte1, byte0.
     * |        |          |0x2 = Byte order of program data to SPI Flash is byte1, byte0, byte3, byte2, byte5, byte4, byte7, byte6.
     * |        |          |0x3 = Byte order of program data to SPI Flash is byte6, byte7, byte4, byte5, byte2, byte3, byte0, byte1.
     * |        |          |Note: Only used for DMA Write mode.
     * |[30:28] |BM_DATA   |SPI Interface Bit Mode for Data Phase
     * |        |          |0x0 = Standard mode.
     * |        |          |0x1 = Dual mode.
     * |        |          |0x2 = Quad mode.
     * |        |          |0x3 = Octal mode.
     * |        |          |Other = Reserved.
     * |        |          |Note: Only used for DMA Write mode.
     * @var SPIM_T::PHDMAR
     * Offset: 0x58  Phase Setting Register for DMA Read Mode
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |DW_CMD    |Data Width for Command Phase
     * |        |          |This specifies how many bits are transmitted in this phase.
     * |        |          |0x0 = No command phase.
     * |        |          |0x1 = 8 bits.
     * |        |          |0x2 = 16 bits.
     * |        |          |0x3 = 24 bits.
     * |        |          |0x4 = 32 bits.
     * |        |          |Other = Reserved.
     * |        |          |Note: Only used for DMA Read mode.
     * |[3]     |DTR_CMD   |Double Transfer Rate Mode Enable Bit for Command Phase
     * |        |          |In master mode, SPI will transmit data at both rising edge and falling edge of SPI bus clock.
     * |        |          |0 = DTR mode Disabled (i.e. Single Transfer Rate (STR) mode enabled).
     * |        |          |1 = DTR mode Enabled.
     * |        |          |Note: Only used for DMA Read mode.
     * |[6:4]   |BM_CMD    |SPI Interface Bit Mode for Command Phase
     * |        |          |0x0 = Standard mode.
     * |        |          |0x1 = Dual mode.
     * |        |          |0x2 = Quad mode.
     * |        |          |0x3 = Octal mode.
     * |        |          |Other = Reserved.
     * |        |          |Note: Only used for DMA Read mode.
     * |[10:8]  |DW_ADDR   |Data Width for Address Phase
     * |        |          |This specifies how many bits are transmitted in this phase.
     * |        |          |0x0 = No address phase.
     * |        |          |0x1 = 8 bits.
     * |        |          |0x2 = 16 bits.
     * |        |          |0x3 = 24 bits.
     * |        |          |0x4 = 32 bits.
     * |        |          |Other = Reserved.
     * |        |          |Note: Only used for DMA Read mode.
     * |[11]    |DTR_ADDR  |Double Transfer Rate Mode Enable Bit for Address Phase
     * |        |          |In master mode, SPI will transmit data at both rising edge and falling edge of SPI bus clock.
     * |        |          |0 = DTR mode Disabled (i.e. Single Transfer Rate (STR) mode enabled).
     * |        |          |1 = DTR mode Enabled.
     * |        |          |Note: Only used for DMA Read mode.
     * |[14:12] |BM_ADDR   |SPI Interface Bit Mode for Address Phase
     * |        |          |0x0 = Standard mode.
     * |        |          |0x1 = Dual mode.
     * |        |          |0x2 = Quad mode.
     * |        |          |0x3 = Octal mode.
     * |        |          |Other = Reserved.
     * |        |          |Note: Only used for DMA Read mode.
     * |[18:16] |DW_MODE   |Data Width for Mode Phase
     * |        |          |This specifies how many bits are transmitted in this phase.
     * |        |          |0x0 = No mode phase.
     * |        |          |0x1 = 8 bits.
     * |        |          |0x2 = 16 bits.
     * |        |          |0x3 = 24 bits.
     * |        |          |0x4 = 32 bits.
     * |        |          |Other = Reserved.
     * |        |          |Note: Only used for DMA Read mode.
     * |[19]    |DTR_MODE  |Double Transfer Rate Mode Enable Bit for Mode Phase
     * |        |          |In master mode, SPI will transmit data at both rising edge and falling edge of SPI bus clock.
     * |        |          |0 = DTR mode Disabled (i.e. Single Transfer Rate (STR) mode enabled).
     * |        |          |1 = DTR mode Enabled.
     * |        |          |Note: Only used for DMA Read mode.
     * |[22:20] |BM_MODE   |SPI Interface Bit Mode for Mode Phase
     * |        |          |0x0 = Standard mode.
     * |        |          |0x1 = Dual mode.
     * |        |          |0x2 = Quad mode.
     * |        |          |0x3 = Octal mode.
     * |        |          |Other = Reserved.
     * |        |          |Note: Only used for DMA Read mode.
     * |[24]    |DTR_DATA  |Double Transfer Rate Mode Enable Bit for Data Phase
     * |        |          |In master mode, SPI will receive data at both rising edge and falling edge of SPI bus clock.
     * |        |          |0 = DTR mode Disabled (i.e. Single Transfer Rate (STR) mode enabled).
     * |        |          |1 = DTR mode Enabled.
     * |        |          |Note: Only used for DMA Read mode.
     * |[25]    |RDQS_DATA |Read DQS Mode Enable Bit for Data Phase
     * |        |          |In SPI master mode, SPI uses read DQS signal, which is generated by SPI Flash, to sample RX data from SPI Flash when Read DQS mode is enabled.
     * |        |          |0 = Read DQS mode Disabled.
     * |        |          |1 = Read DQS mode Enabled.
     * |        |          |Note: Only used for DMA Read mode.
     * |[27:26] |RBO_DATA  |Received Data Byte Order of Received Data Phase for Octal SPI Flash
     * |        |          |0x0 = Byte order of received data to SPI Flash is byte0, byte1, byte2, byte3, byte4, byte5, byte6, byte7.
     * |        |          |0x1 = Byte order of received data to SPI Flash is byte7, byte6, byte5, byte4, byte3, byte2, byte1, byte0.
     * |        |          |0x2 = Byte order of received data to SPI Flash is byte1, byte0, byte3, byte2, byte5, byte4, byte7, byte6.
     * |        |          |0x3 = Byte order of received data to SPI Flash is byte6, byte7, byte4, byte5, byte2, byte3, byte0, byte1.
     * |        |          |Note: Only used for DMA Read mode.
     * |[30:28] |BM_DATA   |SPI Interface Bit Mode for Data Phase
     * |        |          |0x0 = Standard mode.
     * |        |          |0x1 = Dual mode.
     * |        |          |0x2 = Quad mode.
     * |        |          |0x3 = Octal mode.
     * |        |          |Other = Reserved.
     * |        |          |Note: Only used for DMA Read mode.
     * @var SPIM_T::PHDMM
     * Offset: 0x5C  Phase Setting Register for Direct Memory Mapping Mode
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |DW_CMD    |Data Width for Command Phase
     * |        |          |This specifies how many bits are transmitted in this phase.
     * |        |          |0x0 = No command phase.
     * |        |          |0x1 = 8 bits.
     * |        |          |0x2 = 16 bits.
     * |        |          |0x3 = 24 bits.
     * |        |          |0x4 = 32 bits.
     * |        |          |Other = Reserved.
     * |        |          |Note: Only used for Direct Memory Mapping mode.
     * |[3]     |DTR_CMD   |Double Transfer Rate Mode Enable Bit for Command Phase
     * |        |          |In master mode, SPI will transmit data at both rising edge and falling edge of SPI bus clock.
     * |        |          |0 = DTR mode Disabled (i.e. Single Transfer Rate (STR) mode enabled).
     * |        |          |1 = DTR mode Enabled.
     * |        |          |Note: Only used for Direct Memory Mapping mode.
     * |[6:4]   |BM_CMD    |SPI Interface Bit Mode for Command Phase
     * |        |          |0x0 = Standard mode.
     * |        |          |0x1 = Dual mode.
     * |        |          |0x2 = Quad mode.
     * |        |          |0x3 = Octal mode.
     * |        |          |Other = Reserved.
     * |        |          |Note: Only used for Direct Memory Mapping mode.
     * |[10:8]  |DW_ADDR   |Data Width for Address Phase
     * |        |          |This specifies how many bits are transmitted in this phase.
     * |        |          |0x0 = No address phase.
     * |        |          |0x1 = 8 bits.
     * |        |          |0x2 = 16 bits.
     * |        |          |0x3 = 24 bits.
     * |        |          |0x4 = 32 bits.
     * |        |          |Other = Reserved.
     * |        |          |Note: Only used for Direct Memory Mapping mode.
     * |[11]    |DTR_ADDR  |Double Transfer Rate Mode Enable Bit for Address Phase
     * |        |          |In master mode, SPI will transmit data at both rising edge and falling edge of SPI bus clock.
     * |        |          |0 = DTR mode Disabled (i.e. Single Transfer Rate (STR) mode enabled).
     * |        |          |1 = DTR mode Enabled.
     * |        |          |Note: Only used for Direct Memory Mapping mode.
     * |[14:12] |BM_ADDR   |SPI Interface Bit Mode for Address Phase
     * |        |          |0x0 = Standard mode.
     * |        |          |0x1 = Dual mode.
     * |        |          |0x2 = Quad mode.
     * |        |          |0x3 = Octal mode.
     * |        |          |Other = Reserved.
     * |        |          |Note: Only used for Direct Memory Mapping mode.
     * |[18:16] |DW_MODE   |Data Width for Mode Phase
     * |        |          |This specifies how many bits are transmitted in this phase.
     * |        |          |0x0 = No mode phase.
     * |        |          |0x1 = 8 bits.
     * |        |          |0x2 = 16 bits.
     * |        |          |0x3 = 24 bits.
     * |        |          |0x4 = 32 bits.
     * |        |          |Other = Reserved.
     * |        |          |Note: Only used for Direct Memory Mapping mode.
     * |[19]    |DTR_MODE  |Double Transfer Rate Mode Enable Bit for Mode Phase
     * |        |          |In master mode, SPI will transmit data at both rising edge and falling edge of SPI bus clock.
     * |        |          |0 = DTR mode Disabled (i.e. Single Transfer Rate (STR) mode enabled).
     * |        |          |1 = DTR mode Enabled.
     * |        |          |Note: Only used for Direct Memory Mapping mode.
     * |[22:20] |BM_MODE   |SPI Interface Bit Mode for Mode Phase
     * |        |          |0x0 = Standard mode.
     * |        |          |0x1 = Dual mode.
     * |        |          |0x2 = Quad mode.
     * |        |          |0x3 = Octal mode.
     * |        |          |Other = Reserved.
     * |        |          |Note: Only used for Direct Memory Mapping mode.
     * |[24]    |DTR_DATA  |Double Transfer Rate Mode Enable Bit for Data Phase
     * |        |          |In master mode, SPI will receive data at both rising edge and falling edge of SPI bus clock.
     * |        |          |0 = DTR mode Disabled (i.e. Single Transfer Rate (STR) mode enabled).
     * |        |          |1 = DTR mode Enabled.
     * |        |          |Note: Only used for Direct Memory Mapping mode.
     * |[25]    |RDQS_DATA |Read DQS Mode Enable Bit for Data Phase
     * |        |          |In SPI master mode, SPI uses read DQS signal, which is generated by SPI Flash, to sample RX data from SPI Flash when Read DQS mode is enabled.
     * |        |          |0 = Read DQS mode Disabled.
     * |        |          |1 = Read DQS mode Enabled.
     * |        |          |Note: Only used for Direct Memory Mapping mode.
     * |[27:26] |RBO_DATA  |Received Data Byte Order of Received Data Phase for Octal SPI Flash
     * |        |          |0x0 = Byte order of received data to SPI Flash is byte0, byte1, byte2, byte3, byte4, byte5, byte6, byte7.
     * |        |          |0x1 = Byte order of received data to SPI Flash is byte7, byte6, byte5, byte4, byte3, byte2, byte1, byte0.
     * |        |          |0x2 = Byte order of received data to SPI Flash is byte1, byte0, byte3, byte2, byte5, byte4, byte7, byte6.
     * |        |          |0x3 = Byte order of received data to SPI Flash is byte6, byte7, byte4, byte5, byte2, byte3, byte0, byte1.
     * |        |          |Note: Only used for Direct Memory Mapping mode.
     * |[30:28] |BM_DATA   |SPI Interface Bit Mode for Data Phase
     * |        |          |0x0 = Standard mode.
     * |        |          |0x1 = Dual mode.
     * |        |          |0x2 = Quad mode.
     * |        |          |0x3 = Octal mode.
     * |        |          |Other = Reserved.
     * |        |          |Note: Only used for Direct Memory Mapping mode.
     * @var SPIM_T::DLL0
     * Offset: 0x68  HYPERDLL Control and Status Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |DLLOLDO   |HYPERDLL OLDO Enable Bit
     * |        |          |0 = HYPERDLL OLDO is disabled, and HYPERDLL circuit is in Power-down mode.
     * |        |          |1 = HYPERDLL OLDO is enabled, and HYPERDLL circuit is in power enable mode.
     * |        |          |Note 1: HYPERDLL reference clock will start to send after user sets DLLOLDO to 0x1.
     * |        |          |Note 2: User only writes 1u2019b1 to DLLOLDO (SPIM_DLL0[0]) once before user starts to trim delay step number of HYPERDLL.
     * |[1]     |DLLOVRST  |HYPERDLL Output Valid Counter Reset Enable
     * |        |          |0 = HYPERDLL output valid counter is not reseted to 0x0 and it does not start to count.
     * |        |          |1 = HYPERDLL output valid counter is reseted to 0x0 and it starts to count from 0x0 to DLLOVNUM (SPIM_DLL1[15:0]).
     * |        |          |Note 1: This bit will be cleared automatically.
