zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/spim_reg.h
     * |        |          |Note 2: User only writes 1u2019b1 to DLLOVRST once before user starts to trim delay step number of HYPERDLL
     * |        |          |User needs to set DLLOVRST again to wait HYPERDLL output valid when one of frequencies of SPI output bus clock/HyperBus clock, HYPERDLL reference clock, or RWDS/DS clock are changed.
     * |[2]     |DLLCLKON  |HYPERDLL Clock Divider Circuit Status Bit (Read Only)
     * |        |          |0 = HYPERDLL clock divider circuit is disabled after HYPERDLL OLDO is enabled.
     * |        |          |1 = HYPERDLL clock divider circuit is enabled after HYPERDLL OLDO is enabled.
     * |        |          |Note: User needs to check HYPERDLL Datasheet to know time interval that HYPERDLL clock divider circuit can be enabled after HYPERDLL OLDO is enabled.
     * |[3]     |DLLLOCK   |HYPERDLL Lock Status Bit (Read Only)
     * |        |          |0 = HYPERDLL is not locked after HYPERDLL reference clock sends to HYPERDLL circuit.
     * |        |          |1 = HYPERDLL is locked after HYPERDLL reference clock sends to HYPERDLL circuit.
     * |        |          |Note: User needs to check HYPERDLL Datasheet to know HYPERDLL lock time.
     * |[4]     |DLLREADY  |HYPERDLL Output Ready Status Bit (Read Only)
     * |        |          |0 = HYPERDLL output is not ready, and HYPERDLL output is not ready to use.
     * |        |          |1 = HYPERDLL output is ready, and HYPERDLL output is ready to use.
     * |        |          |Note: User needs to check status of HYPERDLL output to ready before HYPERDLL output can be used correctly.
     * |[5]     |DLL_REF   |HYPERDLL Refresh Status Bit (Read Only)
     * |        |          |0 = The updating flow of new HYPERDLL delay step number DLL_DNUM (SPIM_DLL0[13:8]) of HYPERDLL circuit is finished.
     * |        |          |1 = HYPERDLL circuit is updating the new HYPERDLL delay step number DLL_DNUM (SPIM_DLL0[13:8]).
     * |        |          |Note 1: This bit will be cleared automatically.
     * |        |          |Note 2: User needs to check this bit to know that the refresh flow of HYPERDLL circuit is finished or not.
     * |[6]     |DLLATRDY  |HYPERDLL Auto Trim Ready Status Bit (Read Only)
     * |        |          |0 = HYPERDLL auto trim function is not in ready state when DLLATEN (SPIM_DLL0[16]) is enabled and HYPERDLL output is ready.
     * |        |          |1 = HYPERDLL auto trim function is in ready state when DLLATEN (SPIM_DLL0[16]) is enabled and HYPERDLL output is ready.
     * |        |          |Note 1: User needs to check status of HYPERDLL auto trim function before HYPERDLL output can be used for flow of HYPERDLL auto trim correctly.
     * |        |          |Note 2: This status bit is valid only when DLLATEN (SPIM_DLL0[16]) is enabled.
     * |        |          |Note 3: This status bit will be cleared to 0 when DLLATEN (SPIM_DLL0[16]) is disabled.
     * |[12:8]  |DLL_DNUM  |HYPERDLL Delay Step Number
     * |        |          |Set HYPERDLL delay step number.
     * |        |          |0x0: No delay. (Default)
     * |        |          |0x1: HYPERDLL delay read data strobe of RWDS and DQS with 1x (SPIM output bus clock period)/32
     * |        |          |0x2: HYPERDLL delay read data strobe of RWDS and DQS with 2x (SPIM output bus clock period)/32
     * |        |          |0x3: HYPERDLL delay read data strobe of RWDS and DQS with 3x (SPIM output bus clock period)/32
     * |        |          |....
     * |        |          |0x1f: HYPERDLL delay read data strobe of RWDS and DQS with 31x (SPIM output bus clock period)/32
     * |[16]    |DLLATEN   |HYPERDLL Auto Trim Enable Bit
     * |        |          |0 = HYPERDLL auto trim function is disabled for HYPERDLL normal mode and HYPERDLL BIST1 mode.
     * |        |          |1 = HYPERDLL auto trim function is enabled for HYPERDLL normal mode and HYPERDLL BIST1 mode.
     * |        |          |Note: In HYPERDLL BIST2 mode (loop=1), this control register DLLATEN must be disabled.
     * |[17]    |DLLLOOP   |HYPERDLL Delay Time Self-Test Enable Bit
     * |        |          |0 = HYPERDLL Delay time self-test is disabled.
     * |        |          |1 = HYPERDLL Delay time self-test is enabled.
     * |[18]    |SIGINTEN  |Selection for Clock Source DQS/RWDS of HYPERDLL Open Loop Delay Line
     * |        |          |0 = HYPERDLL clock source DQS/RWDS of HYPERDLL open loop delay line is from SPI Flash and HYPER device.
     * |        |          |1 = HYPERDLL clock source DQS/RWDS of HYPERDLL open loop delay line is from HYPERDLL internal clock divider.
     * |[21:20] |DLLDIVER  |Divider Number Selection of HYPERDLL Internal Clock Divder
     * |        |          |00 = Output frequency of HYPERDLL internal clock divdier equals to input frequency of HYPERDLL internal clock divdier.
     * |        |          |01 = Output frequency of HYPERDLL internal clock divdier is (input frequency of HYPERDLL internal clock divdier)/2.
     * |        |          |10 = Output frequency of HYPERDLL internal clock divdier is (input frequency of HYPERDLL internal clock divdier)/4.
     * |        |          |11 = Output frequency of HYPERDLL internal clock divdier is (input frequency of HYPERDLL internal clock divdier)/8.
     * |[23:22] |DLLFAST   |Band Selection of HYPERDLL Reference Clock
     * |        |          |00 = When frequency of HYPERDLL reference clock equals to 100 MHz.
     * |        |          |01 = When frequency of HYPERDLL reference clock is greater than 100 MHz.
     * @var SPIM_T::DLL1
     * Offset: 0x6C  HYPERDLL Control and Status Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |DLLOVNUM  |Clock Cycle Number between HYPERDLL Lock and HYPERDLL Output Valid
     * |        |          |Set cycle number of HYPERDLL output valid
     * |        |          |The hardware counter of HYPERDLL output valid will count from 0 to the DLLOVNUM after user sets DLLOVRST (SPIM_DLL0[1]) of HYPERDLL output valid counter to 0x1.
     * |        |          |Note 1: User needs to check datasheet of HYPERDLL to know the time interval between HYPERDLL lock done and HYPERDLL output valid.
     * |        |          |Note 2: The unit of this DLLOVNUM is cycle number of HYPERDLL reference clock that its frequency equals to frequency of SPIM output bus clock.
     * |        |          |Note 3: The default value is 0x1388 when frequency of HYPERDLL reference clock is 100 MHz and valid time of HYPERDLL output is 50us.
     * |[31:16] |DLLLKNUM  |Clock Cycle Number between HYPERDLL Clock Divider Enable and HYPERDLL Lock
     * |        |          |Sets cycle number of HYPERDLL lock time after HYPERDLL clock divider is enabled.
     * |        |          |Note 1: User needs to check datasheet of HYPERDLL to know the time interval between HYPERDLL clock divider enable and HYPERDLL lock done.
     * |        |          |Note 2: The unit of this DLLLKNUM is cycle number of HYPERDLL reference clock that its frequency equals to frequency of SPIM output bus clock.
     * |        |          |Note 3: The default value is 0x07D0 when frequency of HYPERDLL reference clock is 100 MHz and HYPERDLL lock time is 20us.
     * @var SPIM_T::DLL2
     * Offset: 0x70  HYPERDLL Control and Status Register 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |TRIMNUM   |Clock Cycle Number between HYPERDLL Output Valid and HYPERDLL Auto Trim Enable
     * |        |          |Sets cycle number of HYPERDLL auto trim to be enabled after HYPERDLL output is valid.
     * |        |          |Note 1: User needs to check Datasheet of HYPERDLL to know the time interval between HYPERDLL output valid and HYPERDLL auto trim enable.
     * |        |          |Note 2: The unit of this TRIMNUM is cycle number of HYPERDLL reference clock that its frequency equals to frequency of SPIM output bus clock.
     * |        |          |Note 3: The default value is 0x07D0 when frequency of HYPERDLL reference clock is 100 MHz and HYPERDLL lock time is 20us.
     * |[31:16] |CLKONNUM  |Clock Cycle Number between HYPERDLL OLDO Enable and HYPERDLL Clock Divider Enable
     * |        |          |Sets cycle number of HYPERDLL divider to be enabled after HYPERDLL OLDO is enabled.
     * |        |          |Note 1: User needs to check Datasheet of HYPERDLL to know the time interval between HYPERDLL OLDO enable and HYPERDLL clock divider enable.
     * |        |          |Note 2: The unit of this CLKONNUM is cycle number of HYPERDLL reference clock that its frequency equals to frequency of SPIM output bus clock.
     * |        |          |Note 3: The default value is 0x07D0 when frequency of HYPERDLL reference clock is 100 MHz and HYPERDLL lock time is 20us.
     * @var SPIM_T::HYPER_CMD
     * Offset: 0x80  HyperBus Command and Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |HYPCMD    |HyperBus Command and Status
     * |        |          |Write
     * |        |          |0001 = Reset Hyper RAM.
     * |        |          |0010 = Read Hyper RAM regsiter (16-Bit, Read Data[15:0].
     * |        |          |0101 = Exit From Hybrid Sleep and deep power down.
     * |        |          |0111 = Write Hyper RAM regsiter (16-Bit, Write Data[15:0].
     * |        |          |1000 = Read 2 Bytes (Read Data[15:0]) from memory space of HyperBus device.
     * |        |          |1001 = Read 4 Bytes (Read Data[31:0]) from memory space of HyperBus device.
     * |        |          |1100 = Write 1 Byte (Write Data[7:0]) to memory space of HyperBus device.
     * |        |          |1101 = Write 2 Bytes (Write Data[15:0]) to memory space of HyperBus device.
     * |        |          |1110 = Write 3 Bytes (Write Data[23:0]) to memory space of HyperBus device.
     * |        |          |1111 = Write 4 Bytes (Write Data[31:0]) to memory space of HyperBus device.
     * |        |          |Other value = reserved.
     * |        |          |Read
     * |        |          |0000 = HyperBus interface is Idle.
     * |        |          |Other value = HyperBus interface is busy.
     * |        |          |Note 1: When an operation is Done, the read value automatically return to 4u2019b0000.
     * |        |          |Note 2: The encryption and decryption of cipher are not supported, and it only uses to send command to HyperBus device, write control register to HyperBus device, and read status register from HyperBus device.
     * @var SPIM_T::HYPER_CONFIG1
     * Offset: 0x84  HyperBus Configuration Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |CSS       |Chip Select Setup Time to Next CK Rising Edge
     * |        |          |This field indicates the setup time between the chip select and the next CK rising edge
     * |        |          |00 = 3.5 HCLK cycles. (default)
     * |        |          |01 = 4.5 HCLK cycles.
     * |        |          |Others = Reserved.
     * |[5:4]   |CSH       |Chip Select Hold Time After CK Falling Edge
     * |        |          |This field indicates the hold time between the last CK falling edge and chip select
     * |        |          |00 = 0.5 HCLK cycles.
     * |        |          |01 = 1.5 HCLK cycles.
     * |        |          |10 = 2.5 HCLK cycles.
     * |        |          |11 = 3.5 HCLK cycles.
     * |        |          |Note: Please set this register to 2u2019b11 when user uses control register SPIM_HYPER_CMD to read register/memory data from Hyper device.
     * |[11:8]  |CSHI      |Chip Select High between Transaction
     * |        |          |This field indicates the inactive period between two HyperBus transactions
     * |        |          |0011 = 4 HCLK cycles.
     * |        |          |....
     * |        |          |1111 = 16 HCLK cycles.
     * |        |          |Others = Reserved.
     * |        |          |Note: This field must meet the HyperBus deviceu2019s specification of tCSHI.
     * |[31:12] |CSMAXLT   |Chip Select Maximum Low Time
     * |        |          |This field indicates the maximum Low period of the chip select (CS#) in one transaction
     * |        |          |0 = 1 HCLK cycle.
     * |        |          |1 = 2 HCLK cycles.
     * |        |          |2 = 3 HCLK cycles.
     * |        |          |3 = 4 HCLK cycles.
     * |        |          |....
     * |        |          |749 = 750 HCLK cycles (3750ns @200 MHz).
     * |        |          |....
     * |        |          |1048574 = 1048575 HCLK cycles.
     * |        |          |1048575 = 1048576 HCLK cycles.
     * |        |          |(1) Setting formula of CSMAXLT when CIPHOFF (SPIM_CTL0[0]) sets to 1u2019b1:
     * |        |          |CSMAXLT = (tCSM/HCLK period) u2013 8*2*(DIVIDER) u2013 21.
     * |        |          |(2) Setting formula of CSMAXLT when CIPHOFF (SPIM_CTL0[0]) sets to 1u2019b0 :
     * |        |          |CSMAXLT = (tCSM/HCLK period) u2013 8*2*(DIVIDER) u2013 54.
     * |        |          |Note1 : This field inidcates the timing of Hyper RAM Chip Select specification so that it has to relative the frequency of HCLK and the DIVIDER (SPIM_CTL1[31:16]) and the unit of the above two formulas are clock cycle number of SPIM HCLK.
     * |        |          |Note2 : This register must be set to 0x000FFFFF for Hyper Flash device.
     * |        |          |Note3 : User needs to check specification of used HYPER RAM device to know the value of timing parameter tCSM with unit "nano second" (ns).
     * @var SPIM_T::HYPER_CONFIG2
     * Offset: 0x88  HyperBus Configuration Register 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[12:8]  |ACCTWR    |Initial Access Time for Write Data to HYPER Device
     * |        |          |This field indicates the initial access cycles for write transaction of the HyperBus
     * |        |          |00001 = 1 CK cycles.
     * |        |          |00010 = 2 CK cycles.
     * |        |          |00011 = 3 CK cycles.
     * |        |          |00100 = 4 CK cycles (default).
     * |        |          |00101 = 5 CK cycles.
     * |        |          |00110 = 6 CK cycles.
     * |        |          |00111 = 7 CK cycles.
     * |        |          |....
     * |        |          |11111 = 31 CK cycles.
     * |        |          |Others = Reserved.
     * |        |          |Note1 : This field must be set to the same value as "Initial Latency" for write operations in Configuration Register 0 in HYPER device.
     * |        |          |Note2 : If user sets value to 0000, the hardware will modify it to 0001 automatically.
     * |[23:16] |RSTNLT    |HyperBus Device RESETN Low Time
     * |        |          |This field indicates the low period of HyperBus device RESETN (RESET#)
     * |        |          |1 = 2 HCLK cycles.
     * |        |          |2 = 3 HCLK cycles.
     * |        |          |3 = 4 HCLK cycles.
     * |        |          |....
     * |        |          |255 = 255 HCLK cycles.
     * |        |          |Note: This field inidcates the timing of HyperBus device RESET# specification so that it has to relative the frequency of HCLK.
     * |[28:24] |ACCTRD    |Initial Access Time for Read Data from HYPER Device
     * |        |          |This field indicates the initial access cycles for read transaction of the HyperBus
     * |        |          |00001 = 1 CK cycles.
     * |        |          |00010 = 2 CK cycles.
     * |        |          |00011 = 3 CK cycles.
     * |        |          |00100 = 4 CK cycles. (default)
     * |        |          |00101 = 5 CK cycles.
     * |        |          |00110 = 6 CK cycles.
     * |        |          |00111 = 7 CK cycles.
     * |        |          |....
     * |        |          |11111 = 31 CK cycles.
     * |        |          |Others = Reserved.
     * |        |          |Note1 : This field must be set to the same value as "Initial Latency" for read operations in Configuration Register 0 in HYPER device.
     * |        |          |Note2 : If user sets value to 0000, the hardware will modify it to 0001 automatically.
     * @var SPIM_T::HYPER_ADR
     * Offset: 0x8C  HyperBus Address Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[24:0]  |HBADDR    |HyperBus Register Address
     * |        |          |Memory Space Range:
     * |        |          | 0x0000_0000 ~ 0x01FF_FFFF
     * |        |          |Register Space Range:
     * |        |          | 0x0000_0000 = Identification Register 0
     * |        |          | 0x0000_0002 = Identification Register 1
     * |        |          | 0x0000_1000 = Configuration Register 0
     * |        |          | 0x0000_1002 = Configuration Register 1
     * |        |          |Note 1: It is "Byte" address.
     * |        |          |Note 2: Up to 32 Mbytesytes of memory space is supported.
     * @var SPIM_T::HYPER_WDATA
     * Offset: 0x90  HyperBus 32-Bits Write Data Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |HBWDATA   |HyperBus 32-Bits Write Data
     * |        |          |To write 1 Byte to HyperBus device, Byte 0 (Data[7:0]) is used
     * |        |          |To write 2 Bytes to HyperBus device, Byte 1~0 (Data[15:0]) is used
     * |        |          |To write 3 Bytes to HyperBus device, Byte 2~0 (Data[23:0]) is used
     * |        |          |To write 4 Bytes to HyperBus device, Byte 3~0 (Data[31:0]) is used
     * @var SPIM_T::HYPER_RDATA
     * Offset: 0x94  HyperBus 32-Bits Read Data Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |HBRDATA   |HyperBus 32-bits Read Data
     * |        |          |32-Bits data read from HyperBus device
     * |        |          |Note 1: The byte order of read data is little endian only.
     * @var SPIM_T::HYPER_INTEN
     * Offset: 0x98  HyperBus Interrupt Enable Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |OPINTEN   |HyperBus Operation Done Interrupt Enable
     * |        |          |0 = Operation done interrupt is Disabled.
     * |        |          |1 = Operation done interrupt is Enabled.
     * @var SPIM_T::HYPER_INTSTS
     * Offset: 0x9C  HyperBus Interrupt Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |OPDONE    |HyperBus Operation Done Interrupt
     * |        |          |0 = HyperBus operation is busy.
     * |        |          |1 = HyperBus operation is done.
     * @var SPIM_T::DMM_TIMEOUT_INTERVAL
     * Offset: 0xA0  SPIM DMM Time-out Interval Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |TOCNTDMM  |Time-Out Counter Setting Value for DMM Read Mode only
     * |        |          |User can set this control register to know if SPIM DMM mode doesnu2019t response read data to MCU over the time interval by this time-out counter settings value, and the time-out event flag of DMM mode (SPIM_DMM_TIMEOUT_FLAG_STS[0]) will go high.
     * |        |          |Note 1: The time interval by this time-out counter settings value equals to time-out counter settings value multiple by clock cycle period of SPIM HCLK.
     * |        |          |Note 2: If setting value of this control register is smaller than 0x1000, then hardware will set this control register to 0x1000 automatically.
     * @var SPIM_T::DMM_TIMEOUT_FLAG_STS
     * Offset: 0xA4  SPIM DMM Time-out Flag Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |DMMTOF    |Time-out Flag for DMM Read Mode only
     * |        |          |0 = There is no time-out event when SPIM is in DMM read mode.
     * |        |          |1 = There is time-out event when SPIM is in DMM read mode.
     * |        |          |Note: Write one to clear to zero for this time-out event flag of DMM mode.
     */
    __IO uint32_t CTL0;                  /*!< [0x0000] Control and Status Register 0                                    */
    __IO uint32_t CTL1;                  /*!< [0x0004] Control and Status Register 1                                    */
    __I  uint32_t RESERVE0[1];
    __IO uint32_t RXCLKDLY;              /*!< [0x000c] RX Clock Delay Control Register                                  */
    __I  uint32_t RX[4];                 /*!< [0x0010 ~ 0x001C] Data Receive Register 0 ~ 3                             */
    __IO uint32_t TX[4];                 /*!< [0x0020 ~ 0x002C] Data Transmit Register 0 ~ 3                            */
    __IO uint32_t SRAMADDR;              /*!< [0x0030] SRAM Memory Address Register                                     */
    __IO uint32_t DMACNT;                /*!< [0x0034] DMA Transfer Byte Count Register                                 */
    __IO uint32_t FADDR;                 /*!< [0x0038] Address Register for SPI Flash and Hyper Device                  */
    __I  uint32_t RESERVE1[2];
    __IO uint32_t DMMCTL;                /*!< [0x0044] Direct Memory Mapping Mode Control Register                      */
    __IO uint32_t CTL2;                  /*!< [0x0048] Control and Status Register 2                                    */
    __IO uint32_t CMDCODE;               /*!< [0x004c] Command Code Register                                            */
    __IO uint32_t MODE;                  /*!< [0x0050] Mode Data Register                                               */
    __IO uint32_t PHDMAW;                /*!< [0x0054] Phase Setting Register for DMA Write Mode                        */
    __IO uint32_t PHDMAR;                /*!< [0x0058] Phase Setting Register for DMA Read Mode                         */
    __IO uint32_t PHDMM;                 /*!< [0x005c] Phase Setting Register for Direct Memory Mapping Mode            */
    __I  uint32_t RESERVE2[2];
    __IO uint32_t DLL0;                  /*!< [0x0068] HYPERDLL Control and Status Register 0                           */
    __IO uint32_t DLL1;                  /*!< [0x006c] HYPERDLL Control and Status Register 1                           */
    __IO uint32_t DLL2;                  /*!< [0x0070] HYPERDLL Control and Status Register 2                           */
    __I  uint32_t RESERVE3[3];
    __IO uint32_t HYPER_CMD;             /*!< [0x0080] HyperBus Command and Status Register                             */
