zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/spim_reg.h
    __IO uint32_t HYPER_CONFIG1;         /*!< [0x0084] HyperBus Configuration Register 1                                */
    __IO uint32_t HYPER_CONFIG2;         /*!< [0x0088] HyperBus Configuration Register 2                                */
    __IO uint32_t HYPER_ADR;             /*!< [0x008c] HyperBus Address Register                                        */
    __IO uint32_t HYPER_WDATA;           /*!< [0x0090] HyperBus 32-Bits Write Data Register                             */
    __I  uint32_t HYPER_RDATA;           /*!< [0x0094] HyperBus 32-Bits Read Data Register                              */
    __IO uint32_t HYPER_INTEN;           /*!< [0x0098] HyperBus Interrupt Enable Register                               */
    __IO uint32_t HYPER_INTSTS;          /*!< [0x009c] HyperBus Interrupt Status Register                               */
    __IO uint32_t DMM_TIMEOUT_INTERVAL;  /*!< [0x00a0] SPIM DMM Time-out Interval Register                              */
    __IO uint32_t DMM_TIMEOUT_FLAG_STS;  /*!< [0x00a4] SPIM DMM Time-out Flag Status Register                           */
} SPIM_T;

/**
    @addtogroup SPIM_CONST SPIM Bit Field Definition
    Constant Definitions for SPIM Controller
@{ */

#define SPIM_CTL0_CIPHOFF_Pos            (0)                                               /*!< SPIM_T::CTL0: CIPHOFF Position         */
#define SPIM_CTL0_CIPHOFF_Msk            (0x1ul << SPIM_CTL0_CIPHOFF_Pos)                  /*!< SPIM_T::CTL0: CIPHOFF Mask             */

#define SPIM_CTL0_DEVMODE_Pos            (2)                                               /*!< SPIM_T::CTL0: DEVMODE Position         */
#define SPIM_CTL0_DEVMODE_Msk            (0x3ul << SPIM_CTL0_DEVMODE_Pos)                  /*!< SPIM_T::CTL0: DEVMODE Mask             */

#define SPIM_CTL0_B4ADDREN_Pos           (5)                                               /*!< SPIM_T::CTL0: B4ADDREN Position        */
#define SPIM_CTL0_B4ADDREN_Msk           (0x1ul << SPIM_CTL0_B4ADDREN_Pos)                 /*!< SPIM_T::CTL0: B4ADDREN Mask            */

#define SPIM_CTL0_IEN_Pos                (6)                                               /*!< SPIM_T::CTL0: IEN Position             */
#define SPIM_CTL0_IEN_Msk                (0x1ul << SPIM_CTL0_IEN_Pos)                      /*!< SPIM_T::CTL0: IEN Mask                 */

#define SPIM_CTL0_IF_Pos                 (7)                                               /*!< SPIM_T::CTL0: IF Position              */
#define SPIM_CTL0_IF_Msk                 (0x1ul << SPIM_CTL0_IF_Pos)                       /*!< SPIM_T::CTL0: IF Mask                  */

#define SPIM_CTL0_DWIDTH_Pos             (8)                                               /*!< SPIM_T::CTL0: DWIDTH Position          */
#define SPIM_CTL0_DWIDTH_Msk             (0x1ful << SPIM_CTL0_DWIDTH_Pos)                  /*!< SPIM_T::CTL0: DWIDTH Mask              */

#define SPIM_CTL0_BURSTNUM_Pos           (13)                                              /*!< SPIM_T::CTL0: BURSTNUM Position        */
#define SPIM_CTL0_BURSTNUM_Msk           (0x3ul << SPIM_CTL0_BURSTNUM_Pos)                 /*!< SPIM_T::CTL0: BURSTNUM Mask            */

#define SPIM_CTL0_QDIODIR_Pos            (15)                                              /*!< SPIM_T::CTL0: QDIODIR Position         */
#define SPIM_CTL0_QDIODIR_Msk            (0x1ul << SPIM_CTL0_QDIODIR_Pos)                  /*!< SPIM_T::CTL0: QDIODIR Mask             */

#define SPIM_CTL0_SUSPITV_Pos            (16)                                              /*!< SPIM_T::CTL0: SUSPITV Position         */
#define SPIM_CTL0_SUSPITV_Msk            (0xful << SPIM_CTL0_SUSPITV_Pos)                  /*!< SPIM_T::CTL0: SUSPITV Mask             */

#define SPIM_CTL0_BITMODE_Pos            (20)                                              /*!< SPIM_T::CTL0: BITMODE Position         */
#define SPIM_CTL0_BITMODE_Msk            (0x3ul << SPIM_CTL0_BITMODE_Pos)                  /*!< SPIM_T::CTL0: BITMODE Mask             */

#define SPIM_CTL0_OPMODE_Pos             (22)                                              /*!< SPIM_T::CTL0: OPMODE Position          */
#define SPIM_CTL0_OPMODE_Msk             (0x3ul << SPIM_CTL0_OPMODE_Pos)                   /*!< SPIM_T::CTL0: OPMODE Mask              */

#define SPIM_CTL0_DTR_NORM_Pos           (24)                                              /*!< SPIM_T::CTL0: DTR_NORM Position        */
#define SPIM_CTL0_DTR_NORM_Msk           (0x1ul << SPIM_CTL0_DTR_NORM_Pos)                 /*!< SPIM_T::CTL0: DTR_NORM Mask            */

#define SPIM_CTL0_RDQS_NORM_Pos          (25)                                              /*!< SPIM_T::CTL0: RDQS_NORM Position       */
#define SPIM_CTL0_RDQS_NORM_Msk          (0x1ul << SPIM_CTL0_RDQS_NORM_Pos)                /*!< SPIM_T::CTL0: RDQS_NORM Mask           */

#define SPIM_CTL0_RBO_NORM_Pos           (26)                                              /*!< SPIM_T::CTL0: RBO_NORM Position        */
#define SPIM_CTL0_RBO_NORM_Msk           (0x3ul << SPIM_CTL0_RBO_NORM_Pos)                 /*!< SPIM_T::CTL0: RBO_NORM Mask            */

#define SPIM_CTL0_SPI_RSTN_Pos           (31)                                              /*!< SPIM_T::CTL0: SPI_RSTN Position        */
#define SPIM_CTL0_SPI_RSTN_Msk           (0x1ul << SPIM_CTL0_SPI_RSTN_Pos)                 /*!< SPIM_T::CTL0: SPI_RSTN Mask            */

#define SPIM_CTL1_SPIMEN_Pos             (0)                                               /*!< SPIM_T::CTL1: SPIMEN Position          */
#define SPIM_CTL1_SPIMEN_Msk             (0x1ul << SPIM_CTL1_SPIMEN_Pos)                   /*!< SPIM_T::CTL1: SPIMEN Mask              */

#define SPIM_CTL1_CACHEOFF_Pos           (1)                                               /*!< SPIM_T::CTL1: CACHEOFF Position        */
#define SPIM_CTL1_CACHEOFF_Msk           (0x1ul << SPIM_CTL1_CACHEOFF_Pos)                 /*!< SPIM_T::CTL1: CACHEOFF Mask            */

#define SPIM_CTL1_CDINVAL_Pos            (3)                                               /*!< SPIM_T::CTL1: CDINVAL Position         */
#define SPIM_CTL1_CDINVAL_Msk            (0x1ul << SPIM_CTL1_CDINVAL_Pos)                  /*!< SPIM_T::CTL1: CDINVAL Mask             */

#define SPIM_CTL1_SS_Pos                 (4)                                               /*!< SPIM_T::CTL1: SS Position              */
#define SPIM_CTL1_SS_Msk                 (0x1ul << SPIM_CTL1_SS_Pos)                       /*!< SPIM_T::CTL1: SS Mask                  */

