zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/spim_reg.h
#define SPIM_CTL1_SSACTPOL_Pos           (5)                                               /*!< SPIM_T::CTL1: SSACTPOL Position        */
#define SPIM_CTL1_SSACTPOL_Msk           (0x1ul << SPIM_CTL1_SSACTPOL_Pos)                 /*!< SPIM_T::CTL1: SSACTPOL Mask            */

#define SPIM_CTL1_IDLETIME_Pos           (8)                                               /*!< SPIM_T::CTL1: IDLETIME Position        */
#define SPIM_CTL1_IDLETIME_Msk           (0xful << SPIM_CTL1_IDLETIME_Pos)                 /*!< SPIM_T::CTL1: IDLETIME Mask            */

#define SPIM_CTL1_DIVIDER_Pos            (16)                                              /*!< SPIM_T::CTL1: DIVIDER Position         */
#define SPIM_CTL1_DIVIDER_Msk            (0xfffful << SPIM_CTL1_DIVIDER_Pos)               /*!< SPIM_T::CTL1: DIVIDER Mask             */

#define SPIM_RXCLKDLY_RDDLYSEL_Pos       (0)                                               /*!< SPIM_T::RXCLKDLY: RDDLYSEL Position    */
#define SPIM_RXCLKDLY_RDDLYSEL_Msk       (0xful << SPIM_RXCLKDLY_RDDLYSEL_Pos)             /*!< SPIM_T::RXCLKDLY: RDDLYSEL Mask        */

#define SPIM_RX0_RXDAT_Pos               (0)                                               /*!< SPIM_T::RX0: RXDAT Position            */
#define SPIM_RX0_RXDAT_Msk               (0xfffffffful << SPIM_RX0_RXDAT_Pos)              /*!< SPIM_T::RX0: RXDAT Mask                */

#define SPIM_RX1_RXDAT_Pos               (0)                                               /*!< SPIM_T::RX1: RXDAT Position            */
#define SPIM_RX1_RXDAT_Msk               (0xfffffffful << SPIM_RX1_RXDAT_Pos)              /*!< SPIM_T::RX1: RXDAT Mask                */

#define SPIM_RX2_RXDAT_Pos               (0)                                               /*!< SPIM_T::RX2: RXDAT Position            */
#define SPIM_RX2_RXDAT_Msk               (0xfffffffful << SPIM_RX2_RXDAT_Pos)              /*!< SPIM_T::RX2: RXDAT Mask                */

#define SPIM_RX3_RXDAT_Pos               (0)                                               /*!< SPIM_T::RX3: RXDAT Position            */
#define SPIM_RX3_RXDAT_Msk               (0xfffffffful << SPIM_RX3_RXDAT_Pos)              /*!< SPIM_T::RX3: RXDAT Mask                */

#define SPIM_TX0_TXDAT_Pos               (0)                                               /*!< SPIM_T::TX0: TXDAT Position            */
#define SPIM_TX0_TXDAT_Msk               (0xfffffffful << SPIM_TX0_TXDAT_Pos)              /*!< SPIM_T::TX0: TXDAT Mask                */

#define SPIM_TX1_TXDAT_Pos               (0)                                               /*!< SPIM_T::TX1: TXDAT Position            */
#define SPIM_TX1_TXDAT_Msk               (0xfffffffful << SPIM_TX1_TXDAT_Pos)              /*!< SPIM_T::TX1: TXDAT Mask                */

#define SPIM_TX2_TXDAT_Pos               (0)                                               /*!< SPIM_T::TX2: TXDAT Position            */
#define SPIM_TX2_TXDAT_Msk               (0xfffffffful << SPIM_TX2_TXDAT_Pos)              /*!< SPIM_T::TX2: TXDAT Mask                */

#define SPIM_TX3_TXDAT_Pos               (0)                                               /*!< SPIM_T::TX3: TXDAT Position            */
#define SPIM_TX3_TXDAT_Msk               (0xfffffffful << SPIM_TX3_TXDAT_Pos)              /*!< SPIM_T::TX3: TXDAT Mask                */

#define SPIM_SRAMADDR_ADDR_Pos           (0)                                               /*!< SPIM_T::SRAMADDR: ADDR Position        */
#define SPIM_SRAMADDR_ADDR_Msk           (0xfffffffful << SPIM_SRAMADDR_ADDR_Pos)          /*!< SPIM_T::SRAMADDR: ADDR Mask            */

#define SPIM_DMACNT_DMACNT_Pos           (0)                                               /*!< SPIM_T::DMACNT: DMACNT Position        */
#define SPIM_DMACNT_DMACNT_Msk           (0xfffffful << SPIM_DMACNT_DMACNT_Pos)            /*!< SPIM_T::DMACNT: DMACNT Mask            */

#define SPIM_FADDR_ADDR_Pos              (0)                                               /*!< SPIM_T::FADDR: ADDR Position           */
#define SPIM_FADDR_ADDR_Msk              (0xfffffffful << SPIM_FADDR_ADDR_Pos)             /*!< SPIM_T::FADDR: ADDR Mask               */

#define SPIM_DMMCTL_ACTSCLKT_Pos         (0)                                               /*!< SPIM_T::DMMCTL: ACTSCLKT Position      */
#define SPIM_DMMCTL_ACTSCLKT_Msk         (0xfful << SPIM_DMMCTL_ACTSCLKT_Pos)              /*!< SPIM_T::DMMCTL: ACTSCLKT Mask          */

#define SPIM_DMMCTL_DESELTIM_Pos         (16)                                              /*!< SPIM_T::DMMCTL: DESELTIM Position      */
#define SPIM_DMMCTL_DESELTIM_Msk         (0xfful << SPIM_DMMCTL_DESELTIM_Pos)              /*!< SPIM_T::DMMCTL: DESELTIM Mask          */

#define SPIM_DMMCTL_BWEN_Pos             (24)                                              /*!< SPIM_T::DMMCTL: BWEN Position          */
#define SPIM_DMMCTL_BWEN_Msk             (0x1ul << SPIM_DMMCTL_BWEN_Pos)                   /*!< SPIM_T::DMMCTL: BWEN Mask              */

#define SPIM_DMMCTL_CREN_Pos             (25)                                              /*!< SPIM_T::DMMCTL: CREN Position          */
#define SPIM_DMMCTL_CREN_Msk             (0x1ul << SPIM_DMMCTL_CREN_Pos)                   /*!< SPIM_T::DMMCTL: CREN Mask              */

#define SPIM_DMMCTL_UACTSCLK_Pos         (26)                                              /*!< SPIM_T::DMMCTL: UACTSCLK Position      */
#define SPIM_DMMCTL_UACTSCLK_Msk         (0x1ul << SPIM_DMMCTL_UACTSCLK_Pos)               /*!< SPIM_T::DMMCTL: UACTSCLK Mask          */

#define SPIM_DMMCTL_HYPDONE_Pos          (27)                                              /*!< SPIM_T::DMMCTL: HYPDONE Position       */
#define SPIM_DMMCTL_HYPDONE_Msk          (0x1ul << SPIM_DMMCTL_HYPDONE_Pos)                /*!< SPIM_T::DMMCTL: HYPDONE Mask           */

#define SPIM_DMMCTL_DMMIDLE_Pos          (31)                                              /*!< SPIM_T::DMMCTL: DMMIDLE Position       */
#define SPIM_DMMCTL_DMMIDLE_Msk          (0x1ul << SPIM_DMMCTL_DMMIDLE_Pos)                /*!< SPIM_T::DMMCTL: DMMIDLE Mask           */

#define SPIM_CTL2_DC_DMAR_Pos            (8)                                               /*!< SPIM_T::CTL2: DC_DMAR Position         */
#define SPIM_CTL2_DC_DMAR_Msk            (0xfful << SPIM_CTL2_DC_DMAR_Pos)                 /*!< SPIM_T::CTL2: DC_DMAR Mask             */

