zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/spim_reg.h
#define SPIM_CTL2_DC_DMM_Pos             (16)                                              /*!< SPIM_T::CTL2: DC_DMM Position          */
#define SPIM_CTL2_DC_DMM_Msk             (0xfful << SPIM_CTL2_DC_DMM_Pos)                  /*!< SPIM_T::CTL2: DC_DMM Mask              */

#define SPIM_CTL2_CAPSMOFF_Pos           (25)                                              /*!< SPIM_T::CTL2: CAPSMOFF Position        */
#define SPIM_CTL2_CAPSMOFF_Msk           (0x1ul << SPIM_CTL2_CAPSMOFF_Pos)                 /*!< SPIM_T::CTL2: CAPSMOFF Mask            */

#define SPIM_CTL2_CAENST_Pos             (26)                                              /*!< SPIM_T::CTL2: CAENST Position          */
#define SPIM_CTL2_CAENST_Msk             (0x1ul << SPIM_CTL2_CAENST_Pos)                   /*!< SPIM_T::CTL2: CAENST Mask              */

#define SPIM_CMDCODE_CMDCODE_Pos         (0)                                               /*!< SPIM_T::CMDCODE: CMDCODE Position      */
#define SPIM_CMDCODE_CMDCODE_Msk         (0xfffffffful << SPIM_CMDCODE_CMDCODE_Pos)        /*!< SPIM_T::CMDCODE: CMDCODE Mask          */

#define SPIM_MODE_MODEDATA_Pos           (0)                                               /*!< SPIM_T::MODE: MODEDATA Position        */
#define SPIM_MODE_MODEDATA_Msk           (0xfffffffful << SPIM_MODE_MODEDATA_Pos)          /*!< SPIM_T::MODE: MODEDATA Mask            */

#define SPIM_PHDMAW_DW_CMD_Pos           (0)                                               /*!< SPIM_T::PHDMAW: DW_CMD Position        */
#define SPIM_PHDMAW_DW_CMD_Msk           (0x7ul << SPIM_PHDMAW_DW_CMD_Pos)                 /*!< SPIM_T::PHDMAW: DW_CMD Mask            */

#define SPIM_PHDMAW_DTR_CMD_Pos          (3)                                               /*!< SPIM_T::PHDMAW: DTR_CMD Position       */
#define SPIM_PHDMAW_DTR_CMD_Msk          (0x1ul << SPIM_PHDMAW_DTR_CMD_Pos)                /*!< SPIM_T::PHDMAW: DTR_CMD Mask           */

#define SPIM_PHDMAW_BM_CMD_Pos           (4)                                               /*!< SPIM_T::PHDMAW: BM_CMD Position        */
#define SPIM_PHDMAW_BM_CMD_Msk           (0x7ul << SPIM_PHDMAW_BM_CMD_Pos)                 /*!< SPIM_T::PHDMAW: BM_CMD Mask            */

#define SPIM_PHDMAW_DW_ADDR_Pos          (8)                                               /*!< SPIM_T::PHDMAW: DW_ADDR Position       */
#define SPIM_PHDMAW_DW_ADDR_Msk          (0x7ul << SPIM_PHDMAW_DW_ADDR_Pos)                /*!< SPIM_T::PHDMAW: DW_ADDR Mask           */

#define SPIM_PHDMAW_DTR_ADDR_Pos         (11)                                              /*!< SPIM_T::PHDMAW: DTR_ADDR Position      */
#define SPIM_PHDMAW_DTR_ADDR_Msk         (0x1ul << SPIM_PHDMAW_DTR_ADDR_Pos)               /*!< SPIM_T::PHDMAW: DTR_ADDR Mask          */

#define SPIM_PHDMAW_BM_ADDR_Pos          (12)                                              /*!< SPIM_T::PHDMAW: BM_ADDR Position       */
#define SPIM_PHDMAW_BM_ADDR_Msk          (0x7ul << SPIM_PHDMAW_BM_ADDR_Pos)                /*!< SPIM_T::PHDMAW: BM_ADDR Mask           */

#define SPIM_PHDMAW_DTR_DATA_Pos         (24)                                              /*!< SPIM_T::PHDMAW: DTR_DATA Position      */
#define SPIM_PHDMAW_DTR_DATA_Msk         (0x1ul << SPIM_PHDMAW_DTR_DATA_Pos)               /*!< SPIM_T::PHDMAW: DTR_DATA Mask          */

#define SPIM_PHDMAW_PBO_DATA_Pos         (26)                                              /*!< SPIM_T::PHDMAW: PBO_DATA Position      */
#define SPIM_PHDMAW_PBO_DATA_Msk         (0x3ul << SPIM_PHDMAW_PBO_DATA_Pos)               /*!< SPIM_T::PHDMAW: PBO_DATA Mask          */

#define SPIM_PHDMAW_BM_DATA_Pos          (28)                                              /*!< SPIM_T::PHDMAW: BM_DATA Position       */
#define SPIM_PHDMAW_BM_DATA_Msk          (0x7ul << SPIM_PHDMAW_BM_DATA_Pos)                /*!< SPIM_T::PHDMAW: BM_DATA Mask           */

#define SPIM_PHDMAR_DW_CMD_Pos           (0)                                               /*!< SPIM_T::PHDMAR: DW_CMD Position        */
#define SPIM_PHDMAR_DW_CMD_Msk           (0x7ul << SPIM_PHDMAR_DW_CMD_Pos)                 /*!< SPIM_T::PHDMAR: DW_CMD Mask            */

#define SPIM_PHDMAR_DTR_CMD_Pos          (3)                                               /*!< SPIM_T::PHDMAR: DTR_CMD Position       */
#define SPIM_PHDMAR_DTR_CMD_Msk          (0x1ul << SPIM_PHDMAR_DTR_CMD_Pos)                /*!< SPIM_T::PHDMAR: DTR_CMD Mask           */

#define SPIM_PHDMAR_BM_CMD_Pos           (4)                                               /*!< SPIM_T::PHDMAR: BM_CMD Position        */
#define SPIM_PHDMAR_BM_CMD_Msk           (0x7ul << SPIM_PHDMAR_BM_CMD_Pos)                 /*!< SPIM_T::PHDMAR: BM_CMD Mask            */

#define SPIM_PHDMAR_DW_ADDR_Pos          (8)                                               /*!< SPIM_T::PHDMAR: DW_ADDR Position       */
#define SPIM_PHDMAR_DW_ADDR_Msk          (0x7ul << SPIM_PHDMAR_DW_ADDR_Pos)                /*!< SPIM_T::PHDMAR: DW_ADDR Mask           */

#define SPIM_PHDMAR_DTR_ADDR_Pos         (11)                                              /*!< SPIM_T::PHDMAR: DTR_ADDR Position      */
#define SPIM_PHDMAR_DTR_ADDR_Msk         (0x1ul << SPIM_PHDMAR_DTR_ADDR_Pos)               /*!< SPIM_T::PHDMAR: DTR_ADDR Mask          */

#define SPIM_PHDMAR_BM_ADDR_Pos          (12)                                              /*!< SPIM_T::PHDMAR: BM_ADDR Position       */
#define SPIM_PHDMAR_BM_ADDR_Msk          (0x7ul << SPIM_PHDMAR_BM_ADDR_Pos)                /*!< SPIM_T::PHDMAR: BM_ADDR Mask           */

#define SPIM_PHDMAR_DW_MODE_Pos          (16)                                              /*!< SPIM_T::PHDMAR: DW_MODE Position       */
#define SPIM_PHDMAR_DW_MODE_Msk          (0x7ul << SPIM_PHDMAR_DW_MODE_Pos)                /*!< SPIM_T::PHDMAR: DW_MODE Mask           */

#define SPIM_PHDMAR_DTR_MODE_Pos         (19)                                              /*!< SPIM_T::PHDMAR: DTR_MODE Position      */
#define SPIM_PHDMAR_DTR_MODE_Msk         (0x1ul << SPIM_PHDMAR_DTR_MODE_Pos)               /*!< SPIM_T::PHDMAR: DTR_MODE Mask          */

