zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/spim_reg.h
#define SPIM_PHDMAR_BM_MODE_Pos          (20)                                              /*!< SPIM_T::PHDMAR: BM_MODE Position       */
#define SPIM_PHDMAR_BM_MODE_Msk          (0x7ul << SPIM_PHDMAR_BM_MODE_Pos)                /*!< SPIM_T::PHDMAR: BM_MODE Mask           */

#define SPIM_PHDMAR_DTR_DATA_Pos         (24)                                              /*!< SPIM_T::PHDMAR: DTR_DATA Position      */
#define SPIM_PHDMAR_DTR_DATA_Msk         (0x1ul << SPIM_PHDMAR_DTR_DATA_Pos)               /*!< SPIM_T::PHDMAR: DTR_DATA Mask          */

#define SPIM_PHDMAR_RDQS_DATA_Pos        (25)                                              /*!< SPIM_T::PHDMAR: RDQS_DATA Position     */
#define SPIM_PHDMAR_RDQS_DATA_Msk        (0x1ul << SPIM_PHDMAR_RDQS_DATA_Pos)              /*!< SPIM_T::PHDMAR: RDQS_DATA Mask         */

#define SPIM_PHDMAR_RBO_DATA_Pos         (26)                                              /*!< SPIM_T::PHDMAR: RBO_DATA Position      */
#define SPIM_PHDMAR_RBO_DATA_Msk         (0x3ul << SPIM_PHDMAR_RBO_DATA_Pos)               /*!< SPIM_T::PHDMAR: RBO_DATA Mask          */

#define SPIM_PHDMAR_BM_DATA_Pos          (28)                                              /*!< SPIM_T::PHDMAR: BM_DATA Position       */
#define SPIM_PHDMAR_BM_DATA_Msk          (0x7ul << SPIM_PHDMAR_BM_DATA_Pos)                /*!< SPIM_T::PHDMAR: BM_DATA Mask           */

#define SPIM_PHDMM_DW_CMD_Pos            (0)                                               /*!< SPIM_T::PHDMM: DW_CMD Position         */
#define SPIM_PHDMM_DW_CMD_Msk            (0x7ul << SPIM_PHDMM_DW_CMD_Pos)                  /*!< SPIM_T::PHDMM: DW_CMD Mask             */

#define SPIM_PHDMM_DTR_CMD_Pos           (3)                                               /*!< SPIM_T::PHDMM: DTR_CMD Position        */
#define SPIM_PHDMM_DTR_CMD_Msk           (0x1ul << SPIM_PHDMM_DTR_CMD_Pos)                 /*!< SPIM_T::PHDMM: DTR_CMD Mask            */

#define SPIM_PHDMM_BM_CMD_Pos            (4)                                               /*!< SPIM_T::PHDMM: BM_CMD Position         */
#define SPIM_PHDMM_BM_CMD_Msk            (0x7ul << SPIM_PHDMM_BM_CMD_Pos)                  /*!< SPIM_T::PHDMM: BM_CMD Mask             */

#define SPIM_PHDMM_DW_ADDR_Pos           (8)                                               /*!< SPIM_T::PHDMM: DW_ADDR Position        */
#define SPIM_PHDMM_DW_ADDR_Msk           (0x7ul << SPIM_PHDMM_DW_ADDR_Pos)                 /*!< SPIM_T::PHDMM: DW_ADDR Mask            */

#define SPIM_PHDMM_DTR_ADDR_Pos          (11)                                              /*!< SPIM_T::PHDMM: DTR_ADDR Position       */
#define SPIM_PHDMM_DTR_ADDR_Msk          (0x1ul << SPIM_PHDMM_DTR_ADDR_Pos)                /*!< SPIM_T::PHDMM: DTR_ADDR Mask           */

#define SPIM_PHDMM_BM_ADDR_Pos           (12)                                              /*!< SPIM_T::PHDMM: BM_ADDR Position        */
#define SPIM_PHDMM_BM_ADDR_Msk           (0x7ul << SPIM_PHDMM_BM_ADDR_Pos)                 /*!< SPIM_T::PHDMM: BM_ADDR Mask            */

#define SPIM_PHDMM_DW_MODE_Pos           (16)                                              /*!< SPIM_T::PHDMM: DW_MODE Position        */
#define SPIM_PHDMM_DW_MODE_Msk           (0x7ul << SPIM_PHDMM_DW_MODE_Pos)                 /*!< SPIM_T::PHDMM: DW_MODE Mask            */

#define SPIM_PHDMM_DTR_MODE_Pos          (19)                                              /*!< SPIM_T::PHDMM: DTR_MODE Position       */
#define SPIM_PHDMM_DTR_MODE_Msk          (0x1ul << SPIM_PHDMM_DTR_MODE_Pos)                /*!< SPIM_T::PHDMM: DTR_MODE Mask           */

#define SPIM_PHDMM_BM_MODE_Pos           (20)                                              /*!< SPIM_T::PHDMM: BM_MODE Position        */
#define SPIM_PHDMM_BM_MODE_Msk           (0x7ul << SPIM_PHDMM_BM_MODE_Pos)                 /*!< SPIM_T::PHDMM: BM_MODE Mask            */

#define SPIM_PHDMM_DTR_DATA_Pos          (24)                                              /*!< SPIM_T::PHDMM: DTR_DATA Position       */
#define SPIM_PHDMM_DTR_DATA_Msk          (0x1ul << SPIM_PHDMM_DTR_DATA_Pos)                /*!< SPIM_T::PHDMM: DTR_DATA Mask           */

#define SPIM_PHDMM_RDQS_DATA_Pos         (25)                                              /*!< SPIM_T::PHDMM: RDQS_DATA Position      */
#define SPIM_PHDMM_RDQS_DATA_Msk         (0x1ul << SPIM_PHDMM_RDQS_DATA_Pos)               /*!< SPIM_T::PHDMM: RDQS_DATA Mask          */

#define SPIM_PHDMM_RBO_DATA_Pos          (26)                                              /*!< SPIM_T::PHDMM: RBO_DATA Position       */
#define SPIM_PHDMM_RBO_DATA_Msk          (0x3ul << SPIM_PHDMM_RBO_DATA_Pos)                /*!< SPIM_T::PHDMM: RBO_DATA Mask           */

#define SPIM_PHDMM_BM_DATA_Pos           (28)                                              /*!< SPIM_T::PHDMM: BM_DATA Position        */
#define SPIM_PHDMM_BM_DATA_Msk           (0x7ul << SPIM_PHDMM_BM_DATA_Pos)                 /*!< SPIM_T::PHDMM: BM_DATA Mask            */

#define SPIM_DLL0_DLLOLDO_Pos            (0)                                               /*!< SPIM_T::DLL0: DLLOLDO Position         */
#define SPIM_DLL0_DLLOLDO_Msk            (0x1ul << SPIM_DLL0_DLLOLDO_Pos)                  /*!< SPIM_T::DLL0: DLLOLDO Mask             */

#define SPIM_DLL0_DLLOVRST_Pos           (1)                                               /*!< SPIM_T::DLL0: DLLOVRST Position        */
#define SPIM_DLL0_DLLOVRST_Msk           (0x1ul << SPIM_DLL0_DLLOVRST_Pos)                 /*!< SPIM_T::DLL0: DLLOVRST Mask            */

#define SPIM_DLL0_DLLCLKON_Pos           (2)                                               /*!< SPIM_T::DLL0: DLLCLKON Position        */
#define SPIM_DLL0_DLLCLKON_Msk           (0x1ul << SPIM_DLL0_DLLCLKON_Pos)                 /*!< SPIM_T::DLL0: DLLCLKON Mask            */

#define SPIM_DLL0_DLLLOCK_Pos            (3)                                               /*!< SPIM_T::DLL0: DLLLOCK Position         */
#define SPIM_DLL0_DLLLOCK_Msk            (0x1ul << SPIM_DLL0_DLLLOCK_Pos)                  /*!< SPIM_T::DLL0: DLLLOCK Mask             */

