zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/spim_reg.h
#define SPIM_DLL0_DLLREADY_Pos           (4)                                               /*!< SPIM_T::DLL0: DLLREADY Position        */
#define SPIM_DLL0_DLLREADY_Msk           (0x1ul << SPIM_DLL0_DLLREADY_Pos)                 /*!< SPIM_T::DLL0: DLLREADY Mask            */

#define SPIM_DLL0_DLL_REF_Pos            (5)                                               /*!< SPIM_T::DLL0: DLL_REF Position         */
#define SPIM_DLL0_DLL_REF_Msk            (0x1ul << SPIM_DLL0_DLL_REF_Pos)                  /*!< SPIM_T::DLL0: DLL_REF Mask             */

#define SPIM_DLL0_DLLATRDY_Pos           (6)                                               /*!< SPIM_T::DLL0: DLLATRDY Position        */
#define SPIM_DLL0_DLLATRDY_Msk           (0x1ul << SPIM_DLL0_DLLATRDY_Pos)                 /*!< SPIM_T::DLL0: DLLATRDY Mask            */

#define SPIM_DLL0_DLL_DNUM_Pos           (8)                                               /*!< SPIM_T::DLL0: DLL_DNUM Position        */
#define SPIM_DLL0_DLL_DNUM_Msk           (0x1ful << SPIM_DLL0_DLL_DNUM_Pos)                /*!< SPIM_T::DLL0: DLL_DNUM Mask            */

#define SPIM_DLL0_DLLATEN_Pos            (16)                                              /*!< SPIM_T::DLL0: DLLATEN Position         */
#define SPIM_DLL0_DLLATEN_Msk            (0x1ul << SPIM_DLL0_DLLATEN_Pos)                  /*!< SPIM_T::DLL0: DLLATEN Mask             */

#define SPIM_DLL0_DLLLOOP_Pos            (17)                                              /*!< SPIM_T::DLL0: DLLLOOP Position         */
#define SPIM_DLL0_DLLLOOP_Msk            (0x1ul << SPIM_DLL0_DLLLOOP_Pos)                  /*!< SPIM_T::DLL0: DLLLOOP Mask             */

#define SPIM_DLL0_SIGINTEN_Pos           (18)                                              /*!< SPIM_T::DLL0: SIGINTEN Position        */
#define SPIM_DLL0_SIGINTEN_Msk           (0x1ul << SPIM_DLL0_SIGINTEN_Pos)                 /*!< SPIM_T::DLL0: SIGINTEN Mask            */

#define SPIM_DLL0_DLLDIVER_Pos           (20)                                              /*!< SPIM_T::DLL0: DLLDIVER Position        */
#define SPIM_DLL0_DLLDIVER_Msk           (0x3ul << SPIM_DLL0_DLLDIVER_Pos)                 /*!< SPIM_T::DLL0: DLLDIVER Mask            */

#define SPIM_DLL0_DLLFAST_Pos            (22)                                              /*!< SPIM_T::DLL0: DLLFAST Position         */
#define SPIM_DLL0_DLLFAST_Msk            (0x3ul << SPIM_DLL0_DLLFAST_Pos)                  /*!< SPIM_T::DLL0: DLLFAST Mask             */

#define SPIM_DLL1_DLLOVNUM_Pos           (0)                                               /*!< SPIM_T::DLL1: DLLOVNUM Position        */
#define SPIM_DLL1_DLLOVNUM_Msk           (0xfffful << SPIM_DLL1_DLLOVNUM_Pos)              /*!< SPIM_T::DLL1: DLLOVNUM Mask            */

#define SPIM_DLL1_DLLLKNUM_Pos           (16)                                              /*!< SPIM_T::DLL1: DLLLKNUM Position        */
#define SPIM_DLL1_DLLLKNUM_Msk           (0xfffful << SPIM_DLL1_DLLLKNUM_Pos)              /*!< SPIM_T::DLL1: DLLLKNUM Mask            */

#define SPIM_DLL2_TRIMNUM_Pos            (0)                                               /*!< SPIM_T::DLL2: TRIMNUM Position         */
#define SPIM_DLL2_TRIMNUM_Msk            (0xfffful << SPIM_DLL2_TRIMNUM_Pos)               /*!< SPIM_T::DLL2: TRIMNUM Mask             */

#define SPIM_DLL2_CLKONNUM_Pos           (16)                                              /*!< SPIM_T::DLL2: CLKONNUM Position        */
#define SPIM_DLL2_CLKONNUM_Msk           (0xfffful << SPIM_DLL2_CLKONNUM_Pos)              /*!< SPIM_T::DLL2: CLKONNUM Mask            */

#define SPIM_HYPER_CMD_HYPCMD_Pos        (0)                                               /*!< SPIM_T::HYPER_CMD: HYPCMD Position     */
#define SPIM_HYPER_CMD_HYPCMD_Msk        (0xful << SPIM_HYPER_CMD_HYPCMD_Pos)              /*!< SPIM_T::HYPER_CMD: HYPCMD Mask         */

#define SPIM_HYPER_CONFIG1_CSS_Pos       (0)                                               /*!< SPIM_T::HYPER_CONFIG1: CSS Position    */
#define SPIM_HYPER_CONFIG1_CSS_Msk       (0x3ul << SPIM_HYPER_CONFIG1_CSS_Pos)             /*!< SPIM_T::HYPER_CONFIG1: CSS Mask        */

#define SPIM_HYPER_CONFIG1_CSH_Pos       (4)                                               /*!< SPIM_T::HYPER_CONFIG1: CSH Position    */
#define SPIM_HYPER_CONFIG1_CSH_Msk       (0x3ul << SPIM_HYPER_CONFIG1_CSH_Pos)             /*!< SPIM_T::HYPER_CONFIG1: CSH Mask        */

#define SPIM_HYPER_CONFIG1_CSHI_Pos      (8)                                               /*!< SPIM_T::HYPER_CONFIG1: CSHI Position   */
#define SPIM_HYPER_CONFIG1_CSHI_Msk      (0xful << SPIM_HYPER_CONFIG1_CSHI_Pos)            /*!< SPIM_T::HYPER_CONFIG1: CSHI Mask       */

#define SPIM_HYPER_CONFIG1_CSMAXLT_Pos   (12)                                              /*!< SPIM_T::HYPER_CONFIG1: CSMAXLT Position*/
#define SPIM_HYPER_CONFIG1_CSMAXLT_Msk   (0xffffful << SPIM_HYPER_CONFIG1_CSMAXLT_Pos)     /*!< SPIM_T::HYPER_CONFIG1: CSMAXLT Mask    */

#define SPIM_HYPER_CONFIG2_ACCTWR_Pos    (8)                                               /*!< SPIM_T::HYPER_CONFIG2: ACCTWR Position */
#define SPIM_HYPER_CONFIG2_ACCTWR_Msk    (0x1ful << SPIM_HYPER_CONFIG2_ACCTWR_Pos)         /*!< SPIM_T::HYPER_CONFIG2: ACCTWR Mask     */

#define SPIM_HYPER_CONFIG2_RSTNLT_Pos    (16)                                              /*!< SPIM_T::HYPER_CONFIG2: RSTNLT Position */
#define SPIM_HYPER_CONFIG2_RSTNLT_Msk    (0xfful << SPIM_HYPER_CONFIG2_RSTNLT_Pos)         /*!< SPIM_T::HYPER_CONFIG2: RSTNLT Mask     */

#define SPIM_HYPER_CONFIG2_ACCTRD_Pos    (24)                                              /*!< SPIM_T::HYPER_CONFIG2: ACCTRD Position */
#define SPIM_HYPER_CONFIG2_ACCTRD_Msk    (0x1ful << SPIM_HYPER_CONFIG2_ACCTRD_Pos)         /*!< SPIM_T::HYPER_CONFIG2: ACCTRD Mask     */

#define SPIM_HYPER_ADR_HBADDR_Pos        (0)                                               /*!< SPIM_T::HYPER_ADR: HBADDR Position     */
#define SPIM_HYPER_ADR_HBADDR_Msk        (0x1fffffful << SPIM_HYPER_ADR_HBADDR_Pos)        /*!< SPIM_T::HYPER_ADR: HBADDR Mask         */

