zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/spim_reg.h
#define SPIM_HYPER_WDATA_HBWDATA_Pos     (0)                                               /*!< SPIM_T::HYPER_WDATA: HBWDATA Position  */
#define SPIM_HYPER_WDATA_HBWDATA_Msk     (0xfffffffful << SPIM_HYPER_WDATA_HBWDATA_Pos)    /*!< SPIM_T::HYPER_WDATA: HBWDATA Mask      */

#define SPIM_HYPER_RDATA_HBRDATA_Pos     (0)                                               /*!< SPIM_T::HYPER_RDATA: HBRDATA Position  */
#define SPIM_HYPER_RDATA_HBRDATA_Msk     (0xfffffffful << SPIM_HYPER_RDATA_HBRDATA_Pos)    /*!< SPIM_T::HYPER_RDATA: HBRDATA Mask      */

#define SPIM_HYPER_INTEN_OPINTEN_Pos     (0)                                               /*!< SPIM_T::HYPER_INTEN: OPINTEN Position  */
#define SPIM_HYPER_INTEN_OPINTEN_Msk     (0x1ul << SPIM_HYPER_INTEN_OPINTEN_Pos)           /*!< SPIM_T::HYPER_INTEN: OPINTEN Mask      */

#define SPIM_HYPER_INTSTS_OPDONE_Pos     (0)                                               /*!< SPIM_T::HYPER_INTSTS: OPDONE Position  */
#define SPIM_HYPER_INTSTS_OPDONE_Msk     (0x1ul << SPIM_HYPER_INTSTS_OPDONE_Pos)           /*!< SPIM_T::HYPER_INTSTS: OPDONE Mask      */

#define SPIM_DMM_TIMEOUT_INTERVAL_TOCNTDMM_Pos (0)                                         /*!< SPIM_T::DMM_TIMEOUT_INTERVAL: TOCNTDMM Position*/
#define SPIM_DMM_TIMEOUT_INTERVAL_TOCNTDMM_Msk (0xfffffffful << SPIM_DMM_TIMEOUT_INTERVAL_TOCNTDMM_Pos) /*!< SPIM_T::DMM_TIMEOUT_INTERVAL: TOCNTDMM Mask*/

#define SPIM_DMM_TIMEOUT_FLAG_STS_DMMTOF_Pos (0)                                           /*!< SPIM_T::DMM_TIMEOUT_FLAG_STS: DMMTOF Position*/
#define SPIM_DMM_TIMEOUT_FLAG_STS_DMMTOF_Msk (0x1ul << SPIM_DMM_TIMEOUT_FLAG_STS_DMMTOF_Pos) /*!< SPIM_T::DMM_TIMEOUT_FLAG_STS: DMMTOF Mask*/

/** @} SPIM_CONST */
/** @} end of SPIM register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __SPIM_REG_H__ */
